org-init/init.org
#+TITLE: Emacs Initialization
#+OPTIONS: toc:2

This is the org-mode version of my Emacs configuration. It is pretty long, but
after having a modular version I've actually found having a hyperlinked output
is super useful. Also, I do like literate programming in general although it's
hard to find a good implementation.

Set the garbage collection threshold to a high value during initialization to
speed things along.

#+BEGIN_SRC emacs-lisp
(setq gc-cons-percentage 0.3
      gc-cons-threshold (* 50 1024 1024))
#+END_SRC

We'll also set up a hook to see how long startup took, and with how many GC
cycles.

#+BEGIN_SRC emacs-lisp
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "Emacs ready in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))
#+END_SRC

* Utility Functions

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § Utility Functions")
#+END_SRC

The functions manipulate the path for executable commands outside of Emacs.
They affect both Emacs =exec-path= variable and the
=PATH= environment variable.

#+BEGIN_SRC emacs-lisp
(defun exec-path-prepend (path)
  "Add PATH to the beginning of the current `exec-path` variable,
  and the shell's `$PATH` variable."
  (unless (member path exec-path)
    (setq exec-path (cons path exec-path))
    (setenv "PATH" (concat path ":" (getenv "PATH")))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun exec-path-append (path)
  "Add PATH to the end of the current `exec-path` variable, and
  the shell's `$PATH` variable."
  (unless (member path exec-path)
    (setq exec-path (append exec-path (list path)))
    (setenv "PATH" (concat (getenv "PATH") ":" path))))
#+END_SRC

The following is a simple predicate that allows for us to add others and be
more descriptive than dealing with the =system-type=
(and other) variables directly.

#+BEGIN_SRC emacs-lisp
(defun system-mac-p ()
  "Return `t` if this is Darwin, else nil."
  (eq system-type 'darwin))
#+END_SRC


* Initial Customization
#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § Initial Customization")
#+END_SRC

** Startup Settings

#+BEGIN_SRC emacs-lisp
(setq echo-keystrokes 0.5
      inhibit-startup-screen t
      inhibit-startup-echo-area-message t
      ring-bell-function 'ignore
      scroll-bar-mode nil
      scroll-margin 1
      scroll-step 1)
#+END_SRC

** Load Path

These paths get added to the module search path, the =lib= directory should be a
symlink to my local Git repository.

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (concat-path user-emacs-directory "lib"))
(add-to-list 'load-path (concat-path user-emacs-directory "lib/skj"))
#+END_SRC

