org-init/init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-10 Fri 15:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Initialization</title>
<meta name="author" content="Simon Johnston" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs Initialization</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0fc310f">1. Utility Functions</a></li>
<li><a href="#orgf449bb4">2. Initial Customization</a>
<ul>
<li><a href="#org81af09f">2.1. Startup Settings</a></li>
<li><a href="#org239c549">2.2. Load Path</a></li>
<li><a href="#org6de379a">2.3. Personal Customization Group</a></li>
<li><a href="#orgc3babb3">2.4. Load Customized Values</a></li>
<li><a href="#orga1e61ea">2.5. User Information</a></li>
<li><a href="#orgfec1cff">2.6. Package Management Setup</a></li>
<li><a href="#org5354dd0">2.7. More Paths</a></li>
</ul>
</li>
<li><a href="#orgf034ae8">3. Generic Configuration</a>
<ul>
<li><a href="#orge3d2b70">3.1. Core UI Settings</a></li>
<li><a href="#org84ff085">3.2. Completion UI Settings</a></li>
<li><a href="#org03f95f7">3.3. O/S Specific UI Settings</a></li>
<li><a href="#org9233651">3.4. Initial Flycheck Settings</a></li>
<li><a href="#org5f61978">3.5. Shell &amp; Terminal Settings</a></li>
<li><a href="#org93144c8">3.6. Gnus</a></li>
<li><a href="#org8bab607">3.7. Remote (TRAMP) Editing</a></li>
<li><a href="#orgf0253eb">3.8. Version Control</a></li>
</ul>
</li>
<li><a href="#org7961659">4. Snippet Support</a>
<ul>
<li><a href="#org521a823">4.1. Core Snippet Support</a></li>
<li><a href="#org33aeed4">4.2. Snippet Collections</a></li>
<li><a href="#orgbb54146">4.3. Snippet Completion</a></li>
</ul>
</li>
<li><a href="#orga3b5897">5. Org-Mode</a>
<ul>
<li><a href="#org316937c">5.1. Initial Configuration</a></li>
<li><a href="#orgc879a56">5.2. Core UI Additions</a></li>
<li><a href="#org0a98213">5.3. Agenda</a></li>
<li><a href="#org91f4647">5.4. Babel</a></li>
<li><a href="#orgaafbb17">5.5. Other Stuff</a></li>
<li><a href="#org65d0f0b">5.6. Key Bindings</a></li>
</ul>
</li>
<li><a href="#orga21dc41">6. Other Writing Modes</a>
<ul>
<li><a href="#org9ee9618">6.1. Focus Mode</a></li>
<li><a href="#orgc807f34">6.2. Emoji Support</a></li>
<li><a href="#org8fef278">6.3. Markdown</a></li>
<li><a href="#org0f90dde">6.4. Blogging</a></li>
<li><a href="#org02f4259">6.5. LaTeX</a></li>
<li><a href="#orgb2406a0">6.6. Spell and Style Checking</a></li>
<li><a href="#orgc2fb8b0">6.7. LaTeX Completion</a></li>
<li><a href="#orga63250b">6.8. Bibliography Completion</a></li>
</ul>
</li>
<li><a href="#org2520f7a">7. Developer Configuration</a>
<ul>
<li><a href="#org594463e">7.1. UI Settings</a></li>
<li><a href="#orga7da52d">7.2. Project Support</a></li>
<li><a href="#org49ad720">7.3. Language Server (Generic)</a></li>
<li><a href="#orgf188ed1">7.4. Test and Debug</a></li>
<li><a href="#org1452d26">7.5. Data Formats</a></li>
<li><a href="#orgbcdb085">7.6. Language Environments</a></li>
<li><a href="#org1cdec41">7.7. AWS Integration</a></li>
<li><a href="#org74748a4">7.8. Developer Services</a></li>
<li><a href="#org1ca8e4e">7.9. For Fun</a></li>
</ul>
</li>
<li><a href="#orge07bce3">8. Work Configuration</a>
<ul>
<li><a href="#orga8893a2">8.1. Paths</a></li>
<li><a href="#org03a4394">8.2. Customization</a></li>
<li><a href="#org62c4122">8.3. Work Packages</a></li>
<li><a href="#org54a5902">8.4. Org Mode</a></li>
</ul>
</li>
<li><a href="#org5cb6fc0">9. Finishing Up</a>
<ul>
<li><a href="#org6a7b4d9">9.1. Reset the GC Threshold</a></li>
<li><a href="#orgd7332e6">9.2. Run Emacs as a Server</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This is the org-mode version of my Emacs configuration. It is pretty long, but
after having a modular version I've actually found having a hyperlinked output
is super useful. Also, I do like literate programming in general although it's
hard to find a good implementation.
</p>

<p>
Set the garbage collection threshold to a high value during initialization to
speed things along.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> gc-cons-percentage 0.3
      gc-cons-threshold <span style="color: #2aa198;">(</span>* 50 1024 1024<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
We'll also set up a hook to see how long startup took, and with how many GC
cycles.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>add-hook 'emacs-startup-hook
          <span style="color: #2aa198;">(</span><span style="color: #859900;">lambda</span> <span style="color: #b58900;">()</span>
            <span style="color: #b58900;">(</span>message <span style="color: #2aa198;">"Emacs ready in %s with %d garbage collections."</span>
                     <span style="color: #859900;">(</span>format <span style="color: #2aa198;">"%.2f seconds"</span>
                             <span style="color: #268bd2;">(</span>float-time
                              <span style="color: #657b83;">(</span>time-subtract after-init-time before-init-time<span style="color: #657b83;">)</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span>
                     gcs-done<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div id="outline-container-org0fc310f" class="outline-2">
<h2 id="org0fc310f"><span class="section-number-2">1.</span> Utility Functions</h2>
<div class="outline-text-2" id="text-1">
<p>
The functions manipulate the path for executable commands outside of Emacs.
They affect both Emacs <code>exec-path</code> variable and the
<code>PATH</code> environment variable.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">exec-path-prepend</span> <span style="color: #2aa198;">(</span>path<span style="color: #2aa198;">)</span>
  <span style="color: #d33682;">"Add PATH to the beginning of the current `exec-path` variable,</span>
<span style="color: #d33682;">  and the shell's `$PATH` variable."</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">unless</span> <span style="color: #b58900;">(</span>member path exec-path<span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span><span style="color: #859900;">setq</span> exec-path <span style="color: #859900;">(</span>cons path exec-path<span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span>setenv <span style="color: #2aa198;">"PATH"</span> <span style="color: #859900;">(</span>concat path <span style="color: #2aa198;">":"</span> <span style="color: #268bd2;">(</span>getenv <span style="color: #2aa198;">"PATH"</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">exec-path-append</span> <span style="color: #2aa198;">(</span>path<span style="color: #2aa198;">)</span>
  <span style="color: #d33682;">"Add PATH to the end of the current `exec-path` variable, and</span>
<span style="color: #d33682;">  the shell's `$PATH` variable."</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">unless</span> <span style="color: #b58900;">(</span>member path exec-path<span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span><span style="color: #859900;">setq</span> exec-path <span style="color: #859900;">(</span>append exec-path <span style="color: #268bd2;">(</span>list path<span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span>setenv <span style="color: #2aa198;">"PATH"</span> <span style="color: #859900;">(</span>concat <span style="color: #268bd2;">(</span>getenv <span style="color: #2aa198;">"PATH"</span><span style="color: #268bd2;">)</span> <span style="color: #2aa198;">":"</span> path<span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
The following is a simple predicate that allows for us to add others and be
more descriptive than dealing with the <code>system-type</code>
(and other) variables directly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">system-mac-p</span> <span style="color: #2aa198;">()</span>
  <span style="color: #d33682;">"Return `t` if this is Darwin, else nil."</span>
  <span style="color: #2aa198;">(</span>eq system-type 'darwin<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgf449bb4" class="outline-2">
<h2 id="orgf449bb4"><span class="section-number-2">2.</span> Initial Customization</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org81af09f" class="outline-3">
<h3 id="org81af09f"><span class="section-number-3">2.1.</span> Startup Settings</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> echo-keystrokes 0.5
      inhibit-startup-screen t
      inhibit-startup-echo-area-message t
      ring-bell-function 'ignore
      scroll-bar-mode nil
      scroll-margin 1
      scroll-step 1<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org239c549" class="outline-3">
<h3 id="org239c549"><span class="section-number-3">2.2.</span> Load Path</h3>
<div class="outline-text-3" id="text-2-2">
<p>
These paths get added to the module search path, the <code>lib</code> directory should be a
symlink to my local Git repository.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>add-to-list 'load-path <span style="color: #2aa198;">(</span>concat-path user-emacs-directory <span style="color: #2aa198;">"lib"</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-to-list 'load-path <span style="color: #2aa198;">(</span>concat-path user-emacs-directory <span style="color: #2aa198;">"lib/skj"</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
