org-init/init.org
** Personal Customization Group

For those things I want to ensure I can find and tweak at runtime I use the
following customization group. This allows you to /=M-x customize-group=/ and
select =skj=.

#+BEGIN_SRC emacs-lisp
(defgroup skj nil
  "Simon's personal environment settings."
  :tag "skj"
  :prefix "skj/")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defcustom
  skj/trace-init
  (if (and (boundp debug-on-error) debug-on-error)
      debug-on-error
    t)
  "Emit tracing messages during initialization, useful with --debug-init."
  :tag "Trace initialization process"
  :group 'skj
  :type 'boolean)
#+END_SRC

** Load Customized Values

It is a good idea to use a separate file for customized settings. Some users
actually create a temporary file so that changes are session-only. However,
I prefer to keep the customization and if they prove useful move them to the
main initialization files.

#+BEGIN_SRC emacs-lisp
(defvar skj/customization-file
  (concat-path user-emacs-directory "custom.el")
  "Location of the file for `custom-*` values.")
#+END_SRC

Assuming that the code in =skj/customization-file= is execute before the code
ahead of this line is not a safe assumption. So load this file proactively.

#+BEGIN_SRC emacs-lisp
(load-file skj/customization-file)
#+END_SRC

** User Information

Basic identity values, these are my common non-work values.

#+BEGIN_SRC emacs-lisp
(defcustom
  skj/primary-email
  "johnstonskj@gmail.com"
  "Primary, non-work, email address."
  :tag "Primary email address"
  :group 'skj
  :type 'string)

(defcustom
  skj/full-name
  "Simon Johnston"
  "Name to go with email-address."
  :tag "Primary email address"
  :group 'skj
  :type 'string)
#+END_SRC

The following are used by Emacs.

#+BEGIN_SRC emacs-lisp
(setq
 user-login-name "johnstonskj"
 user-full-name skj/full-name
 user-mail-address skj/primary-email)
#+END_SRC

This is just useful to have.

#+BEGIN_SRC emacs-lisp
(defvar user-home-directory (expand-file-name "~"))
#+END_SRC

This sets my most common location, and while mostly used by calendaring and
[[*Agenda]], I keep it here.

#+BEGIN_SRC emacs-lisp
(require 'calendar)
(require 'cal-dst)
(require 'solar)

(setq calendar-latitude 47.6062
      calendar-longitude -122.3321
      calendar-location-name "Seattle, WA")

(setq calendar-time-zone -480
      calendar-standard-time-zone-name "PST"
      calendar-daylight-time-zone-name "PDT")
#+END_SRC

This isn't absolutely necessary, but keeping a use-case neutral form seems
like a good idea. See also [[*Google Calendar]].

#+BEGIN_SRC emacs-lisp
(setq calendar-time-zone-name "America/Los_Angeles")
#+END_SRC

** Package Management Setup

Using the basic package management, =package=, as it does all I need. Although
=use-package= has some advantages, especially in lazy loading. There's some good
notes on this [[https://github.com/daviwil/emacs-from-scratch/blob/master/show-notes/Emacs-Scratch-12.org][here]].

#+BEGIN_SRC emacs-lisp
(require 'package)
#+END_SRC

*** Add Package Repositories

Add the most common package archives and set priorities.

#+BEGIN_SRC emacs-lisp
(add-to-list
 'package-archives
 '("melpamarmalade" . "https://marmalade-repo.org/packages/") t)
(add-to-list
 'package-archives
 '("melpa" . "http://melpa.org/packages/") t)
(add-to-list
 'package-archives
 '("melpa-stable" . "https://stable.melpa.org/packages/") t)

(setq package-archive-priorities '(("gnu" . 30)
                                   ("nongnu" . 25)
                                   ("melpa-stable" . 20)
                                   ("melpa" . 15)
                                   ("marmalade" . 10)))
#+END_SRC

Just in case, refresh the archive contents now.

#+BEGIN_SRC emacs-lisp
(package-initialize)

;; refresh package list if it is not already available
(when (not package-archive-contents)
  (package-refresh-contents))
#+END_SRC

