org-init/init.html

<div id="outline-container-org6de379a" class="outline-3">
<h3 id="org6de379a"><span class="section-number-3">2.3.</span> Personal Customization Group</h3>
<div class="outline-text-3" id="text-2-3">
<p>
For those things I want to ensure I can find and tweak at runtime I use the
following customization group. This allows you to <i><code>M-x customize-group</code></i> and
select <code>skj</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defgroup</span> <span style="color: #268bd2;">skj</span> nil
  <span style="color: #d33682;">"Simon's personal environment settings."</span>
  <span style="color: #6c71c4;">:tag</span> <span style="color: #2aa198;">"skj"</span>
  <span style="color: #6c71c4;">:prefix</span> <span style="color: #2aa198;">"skj/"</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defcustom</span>
  skj/trace-init
  <span style="color: #2aa198;">(</span><span style="color: #859900;">if</span> <span style="color: #b58900;">(</span><span style="color: #859900;">and</span> <span style="color: #859900;">(</span>boundp debug-on-error<span style="color: #859900;">)</span> debug-on-error<span style="color: #b58900;">)</span>
      debug-on-error
    t<span style="color: #2aa198;">)</span>
  <span style="color: #d33682;">"Emit tracing messages during initialization, useful with --debug-init."</span>
  <span style="color: #6c71c4;">:tag</span> <span style="color: #2aa198;">"Trace initialization process"</span>
  <span style="color: #6c71c4;">:group</span> 'skj
  <span style="color: #6c71c4;">:type</span> 'boolean<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3babb3" class="outline-3">
<h3 id="orgc3babb3"><span class="section-number-3">2.4.</span> Load Customized Values</h3>
<div class="outline-text-3" id="text-2-4">
<p>
It is a good idea to use a separate file for customized settings. Some users
actually create a temporary file so that changes are session-only. However,
I prefer to keep the customization and if they prove useful move them to the
main initialization files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defvar</span> <span style="color: #6c71c4;">skj/customization-file</span>
  <span style="color: #2aa198;">(</span>concat-path user-emacs-directory <span style="color: #2aa198;">"custom.el"</span><span style="color: #2aa198;">)</span>
  <span style="color: #d33682;">"Location of the file for `custom-*` values."</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Assuming that the code in <code>skj/customization-file</code> is execute before the code
ahead of this line is not a safe assumption. So load this file proactively.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>load-file skj/customization-file<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga1e61ea" class="outline-3">
<h3 id="orga1e61ea"><span class="section-number-3">2.5.</span> User Information</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Basic identity values, these are my common non-work values.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defcustom</span>
  skj/primary-email
  <span style="color: #2aa198;">"johnstonskj@gmail.com"</span>
  <span style="color: #d33682;">"Primary, non-work, email address."</span>
  <span style="color: #6c71c4;">:tag</span> <span style="color: #2aa198;">"Primary email address"</span>
  <span style="color: #6c71c4;">:group</span> 'skj
  <span style="color: #6c71c4;">:type</span> 'string<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">defcustom</span>
  skj/full-name
  <span style="color: #2aa198;">"Simon Johnston"</span>
  <span style="color: #d33682;">"Name to go with email-address."</span>
  <span style="color: #6c71c4;">:tag</span> <span style="color: #2aa198;">"Primary email address"</span>
  <span style="color: #6c71c4;">:group</span> 'skj
  <span style="color: #6c71c4;">:type</span> 'string<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
The following are used by Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span>
 user-login-name <span style="color: #2aa198;">"johnstonskj"</span>
 user-full-name skj/full-name
 user-mail-address skj/primary-email<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
This is just useful to have.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defvar</span> <span style="color: #6c71c4;">user-home-directory</span> <span style="color: #2aa198;">(</span>expand-file-name <span style="color: #2aa198;">"~"</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
This sets my most common location, and while mostly used by calendaring and
<a href="#org0a98213">5.3</a>, I keep it here.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">calendar</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">cal-dst</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">solar</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> calendar-latitude 47.6062
      calendar-longitude -122.3321
      calendar-location-name <span style="color: #2aa198;">"Seattle, WA"</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> calendar-time-zone -480
      calendar-standard-time-zone-name <span style="color: #2aa198;">"PST"</span>
      calendar-daylight-time-zone-name <span style="color: #2aa198;">"PDT"</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
This isn't absolutely necessary, but keeping a use-case neutral form seems
like a good idea. See also <a href="#org5e66cf4">5.3.4</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> calendar-time-zone-name <span style="color: #2aa198;">"America/Los_Angeles"</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfec1cff" class="outline-3">
<h3 id="orgfec1cff"><span class="section-number-3">2.6.</span> Package Management Setup</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Using the basic package management, <code>package</code>, as it does all I need. Although
<code>use-package</code> has some advantages, especially in lazy loading. There's some good
notes on this <a href="https://github.com/daviwil/emacs-from-scratch/blob/master/show-notes/Emacs-Scratch-12.org">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">package</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org0a8b330" class="outline-4">
<h4 id="org0a8b330"><span class="section-number-4">2.6.1.</span> Add Package Repositories</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
Add the most common package archives and set priorities.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>add-to-list
 'package-archives
 '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"melpamarmalade"</span> . <span style="color: #2aa198;">"https://marmalade-repo.org/packages/"</span><span style="color: #2aa198;">)</span> t<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-to-list
 'package-archives
 '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"melpa"</span> . <span style="color: #2aa198;">"http://melpa.org/packages/"</span><span style="color: #2aa198;">)</span> t<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-to-list
 'package-archives
 '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"melpa-stable"</span> . <span style="color: #2aa198;">"https://stable.melpa.org/packages/"</span><span style="color: #2aa198;">)</span> t<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> package-archive-priorities '<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">"gnu"</span> . 30<span style="color: #b58900;">)</span>
                                   <span style="color: #b58900;">(</span><span style="color: #2aa198;">"nongnu"</span> . 25<span style="color: #b58900;">)</span>
                                   <span style="color: #b58900;">(</span><span style="color: #2aa198;">"melpa-stable"</span> . 20<span style="color: #b58900;">)</span>
                                   <span style="color: #b58900;">(</span><span style="color: #2aa198;">"melpa"</span> . 15<span style="color: #b58900;">)</span>
                                   <span style="color: #b58900;">(</span><span style="color: #2aa198;">"marmalade"</span> . 10<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Just in case, refresh the archive contents now.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>package-initialize<span style="color: #657b83;">)</span>

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">refresh package list if it is not already available</span>
<span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>not package-archive-contents<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span>package-refresh-contents<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
