org-init/init.org
*** Auto-Update Packages

This package provides functionality for automatically updating your Emacs
packages periodically. It is specially useful for people that work in multiple
machines and tend to forget to manually update packages from time to time.

#+BEGIN_SRC emacs-lisp :exports none
(skj/package-install 'auto-package-update)

(require 'auto-package-update)
#+END_SRC

Configure the update to happen every 7 days, at 3:00am, deleting any
old/obsolete packages after updating.

#+BEGIN_SRC emacs-lisp :exports none
(setq auto-package-update-interval 7
      auto-package-update-delete-old-versions t
      auto-package-update-hide-results t)

(auto-package-update-at-time "03:00")
#+END_SRC

=auto-package-update-maybe= will update your installed packages, if there is an
update pending.

#+BEGIN_SRC emacs-lisp :exports none
(auto-package-update-maybe)
#+END_SRC

*** Create =package-install= Wrapper

This is a simple function that wraps the =package-install=. It does allow a
single package or list of packages and only executes the install action if the
package is not already installed.

#+BEGIN_SRC emacs-lisp
(defun skj/package-install (package)
  "Install a single, or list of, PACKAGE."
  (cond
   ((listp package)
    (dolist (pkg package)
      (skj/package-install pkg)))
   ((symbolp package)
    (when (and (not (package-installed-p package))
               (assoc package package-archive-contents))
      (package-install package)))
   (t
    (error "Expecting a package, or list of packages to install, not %s" package))))
#+END_SRC

** More Paths

*** Command Execution Paths

[[https://brew.sh/][Homebrew]] is great, but just in case it isn't on the path, this helps a lot.

#+BEGIN_SRC emacs-lisp
(let ((brew (locate-file "brew" exec-path)))
  (when brew
    (let ((prefix (string-trim (shell-command-to-string (concat brew " --prefix")))))
      (when prefix
        (setq homebrew-prefix prefix)
        (exec-path-prepend (concat-path homebrew-prefix "bin"))))))
#+END_SRC

This is a weird one, can't remember why ...

#+BEGIN_SRC emacs-lisp
(when (and (system-mac-p) (display-graphic-p))
  (exec-path-prepend "usr/local/bin"))
#+END_SRC

*** Common Project Directory

#+BEGIN_SRC emacs-lisp
(require 'xdg)
#+END_SRC

Set the root for all my projects, home and work.

#+BEGIN_SRC emacs-lisp
(defcustom
  skj/project-root-dir
  (expand-file-name "~/Projects")
  "Root directory for development projects."
  :tag "Project root directory"
  :group 'skj
  :type 'directory)
#+END_SRC


* Generic Configuration

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § Generic Configuration")
#+END_SRC

** Core UI Settings
*** Input Encoding

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Input Encoding")
#+END_SRC

We really like UTF-8!

#+BEGIN_SRC emacs-lisp
(set-locale-environment "en_US.UTF-8")
(set-language-environment "UTF-8")
(setq-default buffer-file-coding-system 'utf-8
              coding-system-for-read 'utf-8
              coding-system-for-write 'utf-8
              file-name-coding-system 'utf-8
              keyboard-coding-system 'utf-8
              locale-coding-system 'utf-8
              prefer-coding-system 'utf-8
              require-final-newline t
              terminal-coding-system 'utf-8)
#+END_SRC

#+BEGIN_SRC emacs-lisp :exports none
  (skj/package-install 'iso-transl)

  (require 'iso-transl)
#+END_SRC

