org-init/init.html

<div id="outline-container-org466f679" class="outline-4">
<h4 id="org466f679"><span class="section-number-4">2.6.2.</span> Auto-Update Packages</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
This package provides functionality for automatically updating your Emacs
packages periodically. It is specially useful for people that work in multiple
machines and tend to forget to manually update packages from time to time.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'auto-package-update<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">auto-package-update</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Configure the update to happen every 7 days, at 3:00am, deleting any
old/obsolete packages after updating.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> auto-package-update-interval 7
      auto-package-update-delete-old-versions t
      auto-package-update-hide-results t<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>auto-package-update-at-time <span style="color: #2aa198;">"03:00"</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
<code>auto-package-update-maybe</code> will update your installed packages, if there is an
update pending.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>auto-package-update-maybe<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe81c7a" class="outline-4">
<h4 id="orgbe81c7a"><span class="section-number-4">2.6.3.</span> Create <code>package-install</code> Wrapper</h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
This is a simple function that wraps the <code>package-install</code>. It does allow a
single package or list of packages and only executes the install action if the
package is not already installed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">skj/package-install</span> <span style="color: #2aa198;">(</span>package<span style="color: #2aa198;">)</span>
  <span style="color: #d33682;">"Install a single, or list of, PACKAGE."</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">cond</span>
   <span style="color: #b58900;">(</span><span style="color: #859900;">(</span>listp package<span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #859900;">dolist</span> <span style="color: #268bd2;">(</span>pkg package<span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>skj/package-install pkg<span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
   <span style="color: #b58900;">(</span><span style="color: #859900;">(</span>symbolp package<span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span><span style="color: #859900;">when</span> <span style="color: #268bd2;">(</span><span style="color: #859900;">and</span> <span style="color: #657b83;">(</span>not <span style="color: #2aa198;">(</span>package-installed-p package<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
               <span style="color: #657b83;">(</span>assoc package package-archive-contents<span style="color: #657b83;">)</span><span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>package-install package<span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
   <span style="color: #b58900;">(</span>t
    <span style="color: #859900;">(</span><span style="color: #dc322f; font-weight: bold;">error</span> <span style="color: #2aa198;">"Expecting a package, or list of packages to install, not %s"</span> package<span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5354dd0" class="outline-3">
<h3 id="org5354dd0"><span class="section-number-3">2.7.</span> More Paths</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org6a9f104" class="outline-4">
<h4 id="org6a9f104"><span class="section-number-4">2.7.1.</span> Command Execution Paths</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
<a href="https://brew.sh/">Homebrew</a> is great, but just in case it isn't on the path, this helps a lot.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">let</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span>brew <span style="color: #859900;">(</span>locate-file <span style="color: #2aa198;">"brew"</span> exec-path<span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">when</span> brew
    <span style="color: #b58900;">(</span><span style="color: #859900;">let</span> <span style="color: #859900;">(</span><span style="color: #268bd2;">(</span>prefix <span style="color: #657b83;">(</span>string-trim <span style="color: #2aa198;">(</span>shell-command-to-string <span style="color: #b58900;">(</span>concat brew <span style="color: #2aa198;">" --prefix"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span>
      <span style="color: #859900;">(</span><span style="color: #859900;">when</span> prefix
        <span style="color: #268bd2;">(</span><span style="color: #859900;">setq</span> homebrew-prefix prefix<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span>exec-path-prepend <span style="color: #657b83;">(</span>concat-path homebrew-prefix <span style="color: #2aa198;">"bin"</span><span style="color: #657b83;">)</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
This is a weird one, can't remember why &#x2026;
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span><span style="color: #859900;">and</span> <span style="color: #b58900;">(</span>system-mac-p<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>display-graphic-p<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span>exec-path-prepend <span style="color: #2aa198;">"usr/local/bin"</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org42fe4d0" class="outline-4">
<h4 id="org42fe4d0"><span class="section-number-4">2.7.2.</span> Common Project Directory</h4>
<div class="outline-text-4" id="text-2-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">xdg</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Set the root for all my projects, home and work.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defcustom</span>
  skj/project-root-dir
  <span style="color: #2aa198;">(</span>expand-file-name <span style="color: #2aa198;">"~/Projects"</span><span style="color: #2aa198;">)</span>
  <span style="color: #d33682;">"Root directory for development projects."</span>
  <span style="color: #6c71c4;">:tag</span> <span style="color: #2aa198;">"Project root directory"</span>
  <span style="color: #6c71c4;">:group</span> 'skj
  <span style="color: #6c71c4;">:type</span> 'directory<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-orgf034ae8" class="outline-2">
<h2 id="orgf034ae8"><span class="section-number-2">3.</span> Generic Configuration</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge3d2b70" class="outline-3">
<h3 id="orge3d2b70"><span class="section-number-3">3.1.</span> Core UI Settings</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org8fc26d1" class="outline-4">
<h4 id="org8fc26d1"><span class="section-number-4">3.1.1.</span> Input Encoding</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
We really like UTF-8!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>set-locale-environment <span style="color: #2aa198;">"en_US.UTF-8"</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>set-language-environment <span style="color: #2aa198;">"UTF-8"</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span><span style="color: #859900;">setq-default</span> buffer-file-coding-system 'utf-8
              coding-system-for-read 'utf-8
              coding-system-for-write 'utf-8
              file-name-coding-system 'utf-8
              keyboard-coding-system 'utf-8
              locale-coding-system 'utf-8
              prefer-coding-system 'utf-8
              require-final-newline t
              terminal-coding-system 'utf-8<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span>skj/package-install 'iso-transl<span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">iso-transl</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
