org-init/init.org
*** Basic Editing Customization

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Basic Editing Customization")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq sentence-end-double-space nil)
(setq-default fill-column 78
              indent-tabs-mode nil
              indicate-empty-lines t
              tab-always-indent 'complete
              tab-width 4)
#+END_SRC

Don't use it, and it takes up space

#+BEGIN_SRC emacs-lisp
  (tool-bar-mode -1)
#+END_SRC

Save place in files between Sessions

#+BEGIN_SRC emacs-lisp
  (save-place-mode 1)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (when (>= emacs-major-version 26)
    (pixel-scroll-mode))
  (when (>= emacs-major-version 29)
    (setq pixel-scroll-precision-mode 1))
#+END_SRC

*** Default Face

This isn't so useful on macOS as it doesn't seem to decode weight and width
correctly so I can't use Fira Code Light.

#+BEGIN_SRC emacs-lisp
(set-face-attribute
 'default
 nil
 :inherit nil
 :extend nil
 :stipple nil
 :background "#fdf6e3"
 :foreground "#657b83"
 :inverse-video nil
 :box nil
 :strike-through nil
 :overline nil
 :underline nil
 :slant 'normal
 :weight 'light
 :height 130
 :width 'normal
 :foundry "nil"
 :family "Fira Code Light")
#+END_SRC

*** Theme Support

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Theme Support")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'color-theme-sanityinc-solarized)

(require 'color-theme-sanityinc-solarized)

(setq color-theme-is-global t
      custom-enabled-themes '(sanityinc-solarized-light)
      custom-safe-themes
      '("4cf3221feff536e2b3385209e9b9dc4c2e0818a69a1cdb4b522756bcdf4e00a4" default))

(color-theme-sanityinc-solarized-light)
#+END_SRC

*** Mode Line

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Mode Line")
#+END_SRC

I like to keep this pretty simple, certainly no powerline!.

#+BEGIN_SRC emacs-lisp
(setq display-time-string-forms
      '((propertize (concat " " 24-hours ":" minutes " "))))

(display-time-mode t)
(line-number-mode t)
(column-number-mode t)
#+END_SRC

For battery mode, simplify the usual and use icons, it makes it easier to
find.

#+BEGIN_SRC emacs-lisp
(require 'battery)

(when (functionp battery-status-function)
  (cond ((string= "AC" (battery-format "%L" (funcall battery-status-function)))
         (setq battery-mode-line-format ""))
        ((string-match-p "N/A" (battery-format "%B" (battery-status-function)))
         (setq battery-mode-line-format ""))
        (t
         (setq battery-mode-line-format ":%p%%"))))

(display-battery-mode 1)
#+END_SRC
  
*** Notifications
:PROPERTIES:
:CUSTOM_ID: core-ui-notifications
:END:

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Notifications")
#+END_SRC

Alert is a Growl-workalike for Emacs which uses a common notification
interface and multiple, selectable "styles", whose use is fully
customizable by the user.

#+BEGIN_SRC emacs-lisp :exports none
(skj/package-install 'alert)

(require 'alert)

(setq alert-fade-time 10) ;; seconds
#+END_SRC

Set the alert style: /Native OSX notifier using AppleScript/.

#+BEGIN_SRC emacs-lisp :exports none
(if (system-mac-p)
  (setq alert-default-style 'osx-notifier)
  (setq alert-default-style 'notifications))
#+END_SRC

