org-init/init.html

<div id="outline-container-org9ad9ec8" class="outline-4">
<h4 id="org9ad9ec8"><span class="section-number-4">3.1.2.</span> Basic Editing Customization</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> sentence-end-double-space nil<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span><span style="color: #859900;">setq-default</span> fill-column 78
              indent-tabs-mode nil
              indicate-empty-lines t
              tab-always-indent 'complete
              tab-width 4<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Don't use it, and it takes up space
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span>tool-bar-mode -1<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Save place in files between Sessions
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span>save-place-mode 1<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>&gt;= emacs-major-version 26<span style="color: #2aa198;">)</span>
    <span style="color: #2aa198;">(</span>pixel-scroll-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
  <span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>&gt;= emacs-major-version 29<span style="color: #2aa198;">)</span>
    <span style="color: #2aa198;">(</span><span style="color: #859900;">setq</span> pixel-scroll-precision-mode 1<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org56bf070" class="outline-4">
<h4 id="org56bf070"><span class="section-number-4">3.1.3.</span> Default Face</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
This isn't so useful on macOS as it doesn't seem to decode weight and width
correctly so I can't use Fira Code Light.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>set-face-attribute
 'default
 nil
 <span style="color: #6c71c4;">:inherit</span> nil
 <span style="color: #6c71c4;">:extend</span> nil
 <span style="color: #6c71c4;">:stipple</span> nil
 <span style="color: #6c71c4;">:background</span> <span style="color: #2aa198;">"#fdf6e3"</span>
 <span style="color: #6c71c4;">:foreground</span> <span style="color: #2aa198;">"#657b83"</span>
 <span style="color: #6c71c4;">:inverse-video</span> nil
 <span style="color: #6c71c4;">:box</span> nil
 <span style="color: #6c71c4;">:strike-through</span> nil
 <span style="color: #6c71c4;">:overline</span> nil
 <span style="color: #6c71c4;">:underline</span> nil
 <span style="color: #6c71c4;">:slant</span> 'normal
 <span style="color: #6c71c4;">:weight</span> 'light
 <span style="color: #6c71c4;">:height</span> 130
 <span style="color: #6c71c4;">:width</span> 'normal
 <span style="color: #6c71c4;">:foundry</span> <span style="color: #2aa198;">"nil"</span>
 <span style="color: #6c71c4;">:family</span> <span style="color: #2aa198;">"Fira Code Light"</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org73b29d2" class="outline-4">
<h4 id="org73b29d2"><span class="section-number-4">3.1.4.</span> Theme Support</h4>
<div class="outline-text-4" id="text-3-1-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'color-theme-sanityinc-solarized<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">color-theme-sanityinc-solarized</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> color-theme-is-global t
      custom-enabled-themes '<span style="color: #2aa198;">(</span>sanityinc-solarized-light<span style="color: #2aa198;">)</span>
      custom-safe-themes
      '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"4cf3221feff536e2b3385209e9b9dc4c2e0818a69a1cdb4b522756bcdf4e00a4"</span> default<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>color-theme-sanityinc-solarized-light<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org87e9c83" class="outline-4">
<h4 id="org87e9c83"><span class="section-number-4">3.1.5.</span> Mode Line</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
I like to keep this pretty simple, certainly no powerline!.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> display-time-string-forms
      '<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span>propertize <span style="color: #859900;">(</span>concat <span style="color: #2aa198;">"&#62522; "</span> 24-hours <span style="color: #2aa198;">":"</span> minutes <span style="color: #2aa198;">" "</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>display-time-mode t<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>line-number-mode t<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>column-number-mode t<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
For battery mode, simplify the usual and use icons, it makes it easier to
find.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">battery</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>functionp battery-status-function<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">cond</span> <span style="color: #b58900;">(</span><span style="color: #859900;">(</span>string= <span style="color: #2aa198;">"AC"</span> <span style="color: #268bd2;">(</span>battery-format <span style="color: #2aa198;">"%L"</span> <span style="color: #657b83;">(</span>funcall battery-status-function<span style="color: #657b83;">)</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #859900;">setq</span> battery-mode-line-format <span style="color: #2aa198;">"&#62851;"</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
        <span style="color: #b58900;">(</span><span style="color: #859900;">(</span>string-match-p <span style="color: #2aa198;">"N/A"</span> <span style="color: #268bd2;">(</span>battery-format <span style="color: #2aa198;">"%B"</span> <span style="color: #657b83;">(</span>battery-status-function<span style="color: #657b83;">)</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #859900;">setq</span> battery-mode-line-format <span style="color: #2aa198;">"&#62864;"</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
        <span style="color: #b58900;">(</span>t
         <span style="color: #859900;">(</span><span style="color: #859900;">setq</span> battery-mode-line-format <span style="color: #2aa198;">"&#62840;:%p%%"</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>display-battery-mode 1<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-core-ui-notifications" class="outline-4">
<h4 id="core-ui-notifications"><span class="section-number-4">3.1.6.</span> Notifications</h4>
<div class="outline-text-4" id="text-core-ui-notifications">
<p>
Alert is a Growl-workalike for Emacs which uses a common notification
interface and multiple, selectable "styles", whose use is fully
customizable by the user.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'alert<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">alert</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> alert-fade-time 10<span style="color: #657b83;">)</span> <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">seconds</span>
</pre>
</div>

<p>
Set the alert style: <i>Native OSX notifier using AppleScript</i>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">if</span> <span style="color: #2aa198;">(</span>system-mac-p<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">setq</span> alert-default-style 'osx-notifier<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">setq</span> alert-default-style 'notifications<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
