org-init/init.org
*** Icons

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Icons")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(all-the-icons
   all-the-icons-completion
   all-the-icons-dired
   all-the-icons-ibuffer))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; (all-the-icons-install-fonts)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (when (display-graphic-p)
    (require 'all-the-icons)
    (all-the-icons-completion-mode)
    (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
    (add-hook 'ibuffer-mode-hook #'all-the-icons-ibuffer-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (skj/package-install
   '(mode-icons
     major-mode-icons))

  (when (display-graphic-p)
    (require 'major-mode-icons)

    (major-mode-icons-mode 1)

    (require 'mode-icons)

    (mode-icons-mode))
#+END_SRC

*** Mouse

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Mouse")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'mouse)
(setq mouse-wheel-follow-mouse 't
      mouse-wheel-scroll-amount '(1 ((shift) . 1)))

(xterm-mouse-mode t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(global-set-key [mouse-4] (lambda ()
                            (interactive)
                            (scroll-down 1)))
(global-set-key [mouse-5] (lambda ()
                            (interactive)
                            (scroll-up 1)))
#+END_SRC

*** Windows

#+BEGIN_SRC emacs-lisp :exports none
  (message "INIT: § ▶ ⁋ Windows")
#+END_SRC

Using multiple side-by-side windows is a great way to utilize the
large high-resolution displays that exists today. This [[https://github.com/Lindydancer/multicolumn][package]]
provides the "missing features" of Emacs to create a side-by-side
layout, to navigate efficiently, and to manage the windows.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'multicolumn)
#+END_SRC

In OS X 10.9, each monitor is a separate space. If you want to stretch an
Emacs frame across multiple monitors, you can change this in "System
Preferences -> Mission Control -> Displays have separate Spaces".

*** Buffers

#+BEGIN_SRC emacs-lisp :exports none
  (message "INIT: § ▶ ⁋ Buffers")
#+END_SRC

Recentf is a minor mode that builds a list of recently opened files. This list
is automatically saved across sessions on exiting Emacs - you can then access
this list through a command or the menu.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'recentf)

(setq recentf-max-menu-items 100
      recentf-max-saved-items 100)

(recentf-mode)

(global-set-key "\C-x\ \C-r" 'recentf-open-files)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(ibuffer
   ibuffer-sidebar))

(global-set-key (kbd "C-x C-b") 'ibuffer-sidebar-toggle-sidebar)
#+END_SRC

This file is for lazy people wanting to swap buffers without
typing =/C-x b/= on each window.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'buffer-move)

(when (fboundp 'windmove-default-keybindings)
  (windmove-default-keybindings))
#+END_SRC

This package provides a global minor mode =everlasting-scratch-mode=
that causes the scratch buffer to respawn after it's killed and with
its content restored.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'everlasting-scratch)

(require 'everlasting-scratch)

(add-hook 'after-init-hook 'everlasting-scratch-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq-default major-mode 'text-mode)

(add-hook 'text-mode-hook 'auto-fill-mode)
#+END_SRC

