org-init/init.html

<div id="outline-container-org597e755" class="outline-4">
<h4 id="org597e755"><span class="section-number-4">3.1.7.</span> Icons</h4>
<div class="outline-text-4" id="text-3-1-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>all-the-icons
   all-the-icons-completion
   all-the-icons-dired
   all-the-icons-ibuffer<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">(all-the-icons-install-fonts)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>display-graphic-p<span style="color: #2aa198;">)</span>
    <span style="color: #2aa198;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">all-the-icons</span><span style="color: #2aa198;">)</span>
    <span style="color: #2aa198;">(</span>all-the-icons-completion-mode<span style="color: #2aa198;">)</span>
    <span style="color: #2aa198;">(</span>add-hook 'dired-mode-hook 'all-the-icons-dired-mode<span style="color: #2aa198;">)</span>
    <span style="color: #2aa198;">(</span>add-hook 'ibuffer-mode-hook #'all-the-icons-ibuffer-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span>skj/package-install
   '<span style="color: #2aa198;">(</span>mode-icons
     major-mode-icons<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>display-graphic-p<span style="color: #2aa198;">)</span>
    <span style="color: #2aa198;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">major-mode-icons</span><span style="color: #2aa198;">)</span>

    <span style="color: #2aa198;">(</span>major-mode-icons-mode 1<span style="color: #2aa198;">)</span>

    <span style="color: #2aa198;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">mode-icons</span><span style="color: #2aa198;">)</span>

    <span style="color: #2aa198;">(</span>mode-icons-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org71b7204" class="outline-4">
<h4 id="org71b7204"><span class="section-number-4">3.1.8.</span> Mouse</h4>
<div class="outline-text-4" id="text-3-1-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">mouse</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> mouse-wheel-follow-mouse 't
      mouse-wheel-scroll-amount '<span style="color: #2aa198;">(</span>1 <span style="color: #b58900;">(</span><span style="color: #859900;">(</span>shift<span style="color: #859900;">)</span> . 1<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>xterm-mouse-mode t<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">[</span>mouse-4<span style="color: #2aa198;">]</span> <span style="color: #2aa198;">(</span><span style="color: #859900;">lambda</span> <span style="color: #b58900;">()</span>
                            <span style="color: #b58900;">(</span><span style="color: #859900;">interactive</span><span style="color: #b58900;">)</span>
                            <span style="color: #b58900;">(</span>scroll-down 1<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">[</span>mouse-5<span style="color: #2aa198;">]</span> <span style="color: #2aa198;">(</span><span style="color: #859900;">lambda</span> <span style="color: #b58900;">()</span>
                            <span style="color: #b58900;">(</span><span style="color: #859900;">interactive</span><span style="color: #b58900;">)</span>
                            <span style="color: #b58900;">(</span>scroll-up 1<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab58f6f" class="outline-4">
<h4 id="orgab58f6f"><span class="section-number-4">3.1.9.</span> Windows</h4>
<div class="outline-text-4" id="text-3-1-9">
<p>
Using multiple side-by-side windows is a great way to utilize the
large high-resolution displays that exists today. This <a href="https://github.com/Lindydancer/multicolumn">package</a>
provides the "missing features" of Emacs to create a side-by-side
layout, to navigate efficiently, and to manage the windows.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'multicolumn<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
In OS X 10.9, each monitor is a separate space. If you want to stretch an
Emacs frame across multiple monitors, you can change this in "System
Preferences -&gt; Mission Control -&gt; Displays have separate Spaces".
</p>
</div>
</div>

<div id="outline-container-org20ee114" class="outline-4">
<h4 id="org20ee114"><span class="section-number-4">3.1.10.</span> Buffers</h4>
<div class="outline-text-4" id="text-3-1-10">
<p>
Recentf is a minor mode that builds a list of recently opened files. This list
is automatically saved across sessions on exiting Emacs - you can then access
this list through a command or the menu.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'recentf<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> recentf-max-menu-items 100
      recentf-max-saved-items 100<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>recentf-mode<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">"\C-x\ \C-r"</span> 'recentf-open-files<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>ibuffer
   ibuffer-sidebar<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-x C-b"</span><span style="color: #2aa198;">)</span> 'ibuffer-sidebar-toggle-sidebar<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
This file is for lazy people wanting to swap buffers without
typing <code>/C-x b/</code> on each window.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'buffer-move<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>fboundp 'windmove-default-keybindings<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span>windmove-default-keybindings<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
This package provides a global minor mode <code>everlasting-scratch-mode</code>
that causes the scratch buffer to respawn after it's killed and with
its content restored.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'everlasting-scratch<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">everlasting-scratch</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'after-init-hook 'everlasting-scratch-mode<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq-default</span> major-mode 'text-mode<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'text-mode-hook 'auto-fill-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
