org-init/init.org
*** Multiple Cursors

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Multiple Cursors")
#+END_SRC

[[https://github.com/magnars/multiple-cursors.el][Multiple cursors]] for Emacs.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'multiple-cursors)

(require 'multiple-cursors)
#+END_SRC

When you have an active region that spans multiple lines, the following will add a cursor to each line:

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
#+END_SRC

When you want to add multiple cursors not based on continuous lines, but based on keywords in the buffer, use:

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c m c") 'mc/edit-lines)
(global-set-key (kbd "C-c m >") 'mc/mark-next-like-this)
(global-set-key (kbd "C-c m <") 'mc/mark-previous-like-this)
(global-set-key (kbd "C-c m *") 'mc/mark-more-like-this)
(global-set-key (kbd "C-c m !") 'mc/mark-all-like-this)
#+END_SRC

This package contains [[https://github.com/knu/mc-extras.el][extra functions]] for multiple-cursors mode.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'mc-extras)
#+END_SRC

*** Undo Tree

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Undo Tree")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'undo-tree)

(require 'undo-tree)

(global-undo-tree-mode)
#+END_SRC

** Completion UI Settings
*** Company

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Company")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(company
   company-emojify
   company-prescient
   company-quickhelp))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'company)

(setq company-files-exclusions '(".DS_Store")
      company-tooltip-align-annotations t)

(add-hook 'after-init-hook 'global-company-mode)
#+END_SRC

*** Ivy

#+BEGIN_SRC emacs-lisp :exports none
  (message "INIT: § ▶ ⁋ Ivy")
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (skj/package-install
   '(ivy-action
     ivy-emoji
     ivy-explorer
     ivy-file-preview
     ivy-historian
     ivy-prescient
     ivy-rich))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (require 'ivy)

  (setq ivy-use-virtual-buffers t
        enable-recursive-minibuffers t
        ivy-count-format "(%d/%d) ")

  (ivy-mode 1)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (require 'ivy-explorer)

  (ivy-explorer-mode 1)
#+END_SRC

*** Counsel

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Counsel")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(counsel
   counsel-fd
   counsel-osx-app
   counsel-tramp
   counsel-web))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'counsel)

(setq counsel-find-file-ignore-regexp "\\(?:\\`\\|[/\\]\\)\\(?:[#.]\\)")

(counsel-mode 1)
#+END_SRC

