org-init/init.html

<div id="outline-container-org0b48da3" class="outline-4">
<h4 id="org0b48da3"><span class="section-number-4">3.1.11.</span> Multiple Cursors</h4>
<div class="outline-text-4" id="text-3-1-11">
<p>
<a href="https://github.com/magnars/multiple-cursors.el">Multiple cursors</a> for Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'multiple-cursors<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">multiple-cursors</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
When you have an active region that spans multiple lines, the following will add a cursor to each line:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-S-c C-S-c"</span><span style="color: #2aa198;">)</span> 'mc/edit-lines<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
When you want to add multiple cursors not based on continuous lines, but based on keywords in the buffer, use:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c m c"</span><span style="color: #2aa198;">)</span> 'mc/edit-lines<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c m &gt;"</span><span style="color: #2aa198;">)</span> 'mc/mark-next-like-this<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c m &lt;"</span><span style="color: #2aa198;">)</span> 'mc/mark-previous-like-this<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c m *"</span><span style="color: #2aa198;">)</span> 'mc/mark-more-like-this<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c m !"</span><span style="color: #2aa198;">)</span> 'mc/mark-all-like-this<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
This package contains <a href="https://github.com/knu/mc-extras.el">extra functions</a> for multiple-cursors mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'mc-extras<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc801b2f" class="outline-4">
<h4 id="orgc801b2f"><span class="section-number-4">3.1.12.</span> Undo Tree</h4>
<div class="outline-text-4" id="text-3-1-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'undo-tree<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">undo-tree</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>global-undo-tree-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org84ff085" class="outline-3">
<h3 id="org84ff085"><span class="section-number-3">3.2.</span> Completion UI Settings</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org7632137" class="outline-4">
<h4 id="org7632137"><span class="section-number-4">3.2.1.</span> Company</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>company
   company-emojify
   company-prescient
   company-quickhelp<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">company</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> company-files-exclusions '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">".DS_Store"</span><span style="color: #2aa198;">)</span>
      company-tooltip-align-annotations t<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'after-init-hook 'global-company-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org25d29e1" class="outline-4">
<h4 id="org25d29e1"><span class="section-number-4">3.2.2.</span> Ivy</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span>skj/package-install
   '<span style="color: #2aa198;">(</span>ivy-action
     ivy-emoji
     ivy-explorer
     ivy-file-preview
     ivy-historian
     ivy-prescient
     ivy-rich<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">ivy</span><span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> ivy-use-virtual-buffers t
        enable-recursive-minibuffers t
        ivy-count-format <span style="color: #2aa198;">"(%d/%d) "</span><span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span>ivy-mode 1<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">ivy-explorer</span><span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span>ivy-explorer-mode 1<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4261e0" class="outline-4">
<h4 id="orgd4261e0"><span class="section-number-4">3.2.3.</span> Counsel</h4>
<div class="outline-text-4" id="text-3-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>counsel
   counsel-fd
   counsel-osx-app
   counsel-tramp
   counsel-web<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">counsel</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> counsel-find-file-ignore-regexp <span style="color: #2aa198;">"</span><span style="color: #6c71c4;">\\</span><span style="color: #d33682;">(?:</span><span style="color: #2aa198;">\\`</span><span style="color: #6c71c4;">\\</span><span style="color: #d33682;">|</span><span style="color: #2aa198;">[/\\]</span><span style="color: #6c71c4;">\\</span><span style="color: #d33682;">)</span><span style="color: #6c71c4;">\\</span><span style="color: #d33682;">(?:</span><span style="color: #2aa198;">[#.]</span><span style="color: #6c71c4;">\\</span><span style="color: #d33682;">)</span><span style="color: #2aa198;">"</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>counsel-mode 1<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
