org-init/init.org
*** Key Bindings

Ivy-based interface to standard commands

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-s") 'swiper-isearch)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "M-y") 'counsel-yank-pop)
(global-set-key (kbd "<f1> f") 'counsel-describe-function)
(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
(global-set-key (kbd "<f1> l") 'counsel-find-library)
(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
(global-set-key (kbd "<f2> j") 'counsel-set-variable)
(global-set-key (kbd "C-x b") 'ivy-switch-buffer)
(global-set-key (kbd "C-c v") 'ivy-push-view)
(global-set-key (kbd "C-c V") 'ivy-pop-view)
#+END_SRC

Ivy-based interface to shell and system tools

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c c") 'counsel-compile)
(global-set-key (kbd "C-c g") 'counsel-git)
(global-set-key (kbd "C-c j") 'counsel-git-grep)
(global-set-key (kbd "C-c L") 'counsel-git-log)
(global-set-key (kbd "C-c k") 'counsel-rg)
(global-set-key (kbd "C-c m") 'counsel-linux-app)
(global-set-key (kbd "C-c n") 'counsel-fzf)
(global-set-key (kbd "C-x l") 'counsel-locate)
(global-set-key (kbd "C-c J") 'counsel-file-jump)
(global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
(global-set-key (kbd "C-c w") 'counsel-wmctrl)
#+END_SRC

Ivy-resume (resumes the last Ivy-based completion) and other commands

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c C-r") 'ivy-resume)
(global-set-key (kbd "C-c b") 'counsel-bookmark)
(global-set-key (kbd "C-c d") 'counsel-descbinds)
(global-set-key (kbd "C-c g") 'counsel-git)
(global-set-key (kbd "C-c o") 'counsel-outline)
(global-set-key (kbd "C-c t") 'counsel-load-theme)
(global-set-key (kbd "C-c F") 'counsel-org-file)
#+END_SRC

** O/S Specific UI Settings

*** macOS System Integration

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ macOS System Integration")
#+END_SRC

- =osx-lib=: An Emacs package with functions and commands for interacting with
  macOS.
- =osx-plist=: This is a simple parser for macOS plist files. The main entry
  points are =osx-plist-parse-file= and =osx-plist-parse-buffer=.
- =osx-trash=: Make =delete-by-moving-to-trash= do what you expect it to do on macOS.
- =reveal-in-osx-finder=: Provides the function =reveal-in-osx-finder= for file
  and dired buffers.
  
#+BEGIN_SRC emacs-lisp
(when (system-mac-p)
  (skj/package-install
   '(osx-lib
     osx-plist
     osx-trash
     reveal-in-osx-finder)))

(when (system-mac-p)
  (osx-trash-setup))
#+END_SRC

*** macOS Keyboard Settings

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ macOS Keyboard Settings")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(when (system-mac-p)
  (setq mac-command-modifier 'super
        mac-control-modifier 'control
        mac-option-modifier 'meta
        mac-right-command-modifier 'super
        mac-right-option-modifier 'meta)
  
  (setq ns-alternate-modifier mac-option-modifier
        ns-command-modifier mac-command-modifier
        ns-function-modifier 'hyper
        ns-right-command-modifier mac-right-command-modifier))
#+END_SRC

