org-init/init.html

<div id="outline-container-org1d51660" class="outline-4">
<h4 id="org1d51660"><span class="section-number-4">3.2.4.</span> Key Bindings</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
Ivy-based interface to standard commands
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-s"</span><span style="color: #2aa198;">)</span> 'swiper-isearch<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"M-x"</span><span style="color: #2aa198;">)</span> 'counsel-M-x<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-x C-f"</span><span style="color: #2aa198;">)</span> 'counsel-find-file<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"M-y"</span><span style="color: #2aa198;">)</span> 'counsel-yank-pop<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"&lt;f1&gt; f"</span><span style="color: #2aa198;">)</span> 'counsel-describe-function<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"&lt;f1&gt; v"</span><span style="color: #2aa198;">)</span> 'counsel-describe-variable<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"&lt;f1&gt; l"</span><span style="color: #2aa198;">)</span> 'counsel-find-library<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"&lt;f2&gt; i"</span><span style="color: #2aa198;">)</span> 'counsel-info-lookup-symbol<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"&lt;f2&gt; u"</span><span style="color: #2aa198;">)</span> 'counsel-unicode-char<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"&lt;f2&gt; j"</span><span style="color: #2aa198;">)</span> 'counsel-set-variable<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-x b"</span><span style="color: #2aa198;">)</span> 'ivy-switch-buffer<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c v"</span><span style="color: #2aa198;">)</span> 'ivy-push-view<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c V"</span><span style="color: #2aa198;">)</span> 'ivy-pop-view<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Ivy-based interface to shell and system tools
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c c"</span><span style="color: #2aa198;">)</span> 'counsel-compile<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c g"</span><span style="color: #2aa198;">)</span> 'counsel-git<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c j"</span><span style="color: #2aa198;">)</span> 'counsel-git-grep<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c L"</span><span style="color: #2aa198;">)</span> 'counsel-git-log<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c k"</span><span style="color: #2aa198;">)</span> 'counsel-rg<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c m"</span><span style="color: #2aa198;">)</span> 'counsel-linux-app<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c n"</span><span style="color: #2aa198;">)</span> 'counsel-fzf<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-x l"</span><span style="color: #2aa198;">)</span> 'counsel-locate<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c J"</span><span style="color: #2aa198;">)</span> 'counsel-file-jump<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-S-o"</span><span style="color: #2aa198;">)</span> 'counsel-rhythmbox<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c w"</span><span style="color: #2aa198;">)</span> 'counsel-wmctrl<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Ivy-resume (resumes the last Ivy-based completion) and other commands
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c C-r"</span><span style="color: #2aa198;">)</span> 'ivy-resume<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c b"</span><span style="color: #2aa198;">)</span> 'counsel-bookmark<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c d"</span><span style="color: #2aa198;">)</span> 'counsel-descbinds<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c g"</span><span style="color: #2aa198;">)</span> 'counsel-git<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c o"</span><span style="color: #2aa198;">)</span> 'counsel-outline<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c t"</span><span style="color: #2aa198;">)</span> 'counsel-load-theme<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c F"</span><span style="color: #2aa198;">)</span> 'counsel-org-file<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org03f95f7" class="outline-3">
<h3 id="org03f95f7"><span class="section-number-3">3.3.</span> O/S Specific UI Settings</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-orgceb11df" class="outline-4">
<h4 id="orgceb11df"><span class="section-number-4">3.3.1.</span> macOS System Integration</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li><code>osx-lib</code>: An Emacs package with functions and commands for interacting with
macOS.</li>
<li><code>osx-plist</code>: This is a simple parser for macOS plist files. The main entry
points are <code>osx-plist-parse-file</code> and <code>osx-plist-parse-buffer</code>.</li>
<li><code>osx-trash</code>: Make <code>delete-by-moving-to-trash</code> do what you expect it to do on macOS.</li>
<li><code>reveal-in-osx-finder</code>: Provides the function <code>reveal-in-osx-finder</code> for file
and dired buffers.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>system-mac-p<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span>skj/package-install
   '<span style="color: #b58900;">(</span>osx-lib
     osx-plist
     osx-trash
     reveal-in-osx-finder<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>system-mac-p<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span>osx-trash-setup<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9df3b6" class="outline-4">
<h4 id="orga9df3b6"><span class="section-number-4">3.3.2.</span> macOS Keyboard Settings</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>system-mac-p<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">setq</span> mac-command-modifier 'super
        mac-control-modifier 'control
        mac-option-modifier 'meta
        mac-right-command-modifier 'super
        mac-right-option-modifier 'meta<span style="color: #2aa198;">)</span>
  
  <span style="color: #2aa198;">(</span><span style="color: #859900;">setq</span> ns-alternate-modifier mac-option-modifier
        ns-command-modifier mac-command-modifier
        ns-function-modifier 'hyper
        ns-right-command-modifier mac-right-command-modifier<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>
