org-init/init.org
** Initial Flycheck Settings

#+BEGIN_SRC emacs-lisp
(skj/package-install 'flycheck)

(require 'flycheck)
(add-hook 'after-init-hook #'global-flycheck-mode)
#+END_SRC

Figure this out some day, but it will require a LOT of customization as the
faces are a mess.

#+BEGIN_SRC emacs-lisp
;;(skj/package-install 'flycheck-color-mode-line)

;;(require 'flycheck-color-mode-line)

;; (remove-hook 'flycheck-mode-hook 'flycheck-color-mode-line-mode)
;; (custom-set-faces
;;  '(flycheck-color-mode-line-error-face ((t (:inherit flycheck-fringe-error :foreground "#dc322f" :weight normal))))
;;  '(flycheck-color-mode-line-info-face ((t (:inherit flycheck-fringe-info :foreground "#2aa198" :weight normal))))
;;  '(flycheck-color-mode-line-warning-face ((t (:inherit flycheck-fringe-warning :foreground "#b58900" :weight normal))))
#+END_SRC

** Shell & Terminal Settings

Emacs-libvterm (=/vterm/=) is fully-fledged terminal emulator inside GNU Emacs
based on libvterm, a C library. As a result of using compiled code (instead of
elisp), emacs-libvterm is fully capable, fast, and it can seamlessly handle
large outputs.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'vterm)

(setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"
      vterm-shell "zsh"
      vterm-max-scrollback 10000)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.zsh\\'" . sh-mode))

(add-hook 'sh-mode-hook
          (lambda ()
            (if (string-match "\\.zsh$" buffer-file-name)
                (sh-set-shell "zsh"))))
#+END_SRC
** Gnus

Basic [[https://www.gnu.org/software/emacs/manual/html_node/gnus/][Gnus Newsreader]] configuration. Enter Gnus with =/M-x gnus/=.

#+BEGIN_SRC emacs-lisp
(setq gnus-select-method '(nntp "news.gnus.org"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'nnhackernews)

(add-to-list 'gnus-secondary-select-methods '(nnhackernews ""))
#+END_SRC

Enter the =nnhackernews:news= newsgroup with =/RET/=.

And of course, more icons!

#+BEGIN_SRC emacs-lisp
(skj/package-install 'all-the-icons-gnus)

(when (display-graphic-p)
  (require 'all-the-icons-gnus)
  (all-the-icons-gnus-setup))
#+END_SRC

** Remote (TRAMP) Editing

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(counsel-tramp
   docker-tramp))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq tramp-default-method "ssh")
#+END_SRC

** Version Control

*** Core Git

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Core Git")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(git-attr
   git-blamed
   git-link
   git-timemachine
   git-modes))
#+END_SRC

*** Git and iBuffer

#+BEGIN_SRC emacs-lisp :exports none
  (message "INIT: § ▶ ⁋ Git and iBuffer")
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (skj/package-install '(ibuffer-git))
#+END_SRC

*** Git Issues

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Git Issues")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'git-commit-insert-issue)

(require 'git-commit-insert-issue)

(add-hook 'git-commit-mode-hook 'git-commit-insert-issue-mode)
#+END_SRC

*** Magit

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Magit")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(magit
   magit-diff-flycheck
   magit-lfs
   magit-filenotify))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'magit)

(setq magit-completing-read-function 'ivy-completing-read)
#+END_SRC

This package displays keyword entries from source code comments and Org files
in the Magit status buffer.  Activating an item jumps to it in its file.  By
default, it uses keywords from `hl-todo', minus a few (like "NOTE").

#+BEGIN_SRC emacs-lisp
(skj/package-install 'magit-todos)

(require 'magit-todos)

(magit-todos-mode)
#+END_SRC

*** Diff Highlighting

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Diff Highlighting")
#+END_SRC

`diff-hl-mode' highlights uncommitted changes on the side of the
window (using the /fringe/, by default), allows you to jump between
the hunks and revert them selectively.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'diff-hl)

(require 'diff-hl)

(add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh)
(add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)

(global-diff-hl-mode)
#+END_SRC

