org-init/init.html

<div id="outline-container-org9233651" class="outline-3">
<h3 id="org9233651"><span class="section-number-3">3.4.</span> Initial Flycheck Settings</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'flycheck<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">flycheck</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-hook 'after-init-hook #'global-flycheck-mode<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Figure this out some day, but it will require a LOT of customization as the
faces are a mess.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;;</span><span style="color: #93a1a1; font-style: italic;">(skj/package-install 'flycheck-color-mode-line)</span>

<span style="color: #93a1a1; font-style: italic;">;;</span><span style="color: #93a1a1; font-style: italic;">(require 'flycheck-color-mode-line)</span>

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">(remove-hook 'flycheck-mode-hook 'flycheck-color-mode-line-mode)</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">(custom-set-faces</span>
<span style="color: #93a1a1; font-style: italic;">;;  </span><span style="color: #93a1a1; font-style: italic;">'(flycheck-color-mode-line-error-face ((t (:inherit flycheck-fringe-error :foreground "#dc322f" :weight normal))))</span>
<span style="color: #93a1a1; font-style: italic;">;;  </span><span style="color: #93a1a1; font-style: italic;">'(flycheck-color-mode-line-info-face ((t (:inherit flycheck-fringe-info :foreground "#2aa198" :weight normal))))</span>
<span style="color: #93a1a1; font-style: italic;">;;  </span><span style="color: #93a1a1; font-style: italic;">'(flycheck-color-mode-line-warning-face ((t (:inherit flycheck-fringe-warning :foreground "#b58900" :weight normal))))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f61978" class="outline-3">
<h3 id="org5f61978"><span class="section-number-3">3.5.</span> Shell &amp; Terminal Settings</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Emacs-libvterm (<code>/vterm/</code>) is fully-fledged terminal emulator inside GNU Emacs
based on libvterm, a C library. As a result of using compiled code (instead of
elisp), emacs-libvterm is fully capable, fast, and it can seamlessly handle
large outputs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'vterm<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> term-prompt-regexp <span style="color: #2aa198;">"^[</span><span style="color: #268bd2;">^</span><span style="color: #2aa198;">#$%&gt;\n]*[#$%&gt;] *"</span>
      vterm-shell <span style="color: #2aa198;">"zsh"</span>
      vterm-max-scrollback 10000<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>add-to-list 'auto-mode-alist '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"\\.zsh\\'"</span> . sh-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'sh-mode-hook
          <span style="color: #2aa198;">(</span><span style="color: #859900;">lambda</span> <span style="color: #b58900;">()</span>
            <span style="color: #b58900;">(</span><span style="color: #859900;">if</span> <span style="color: #859900;">(</span>string-match <span style="color: #2aa198;">"\\.zsh$"</span> buffer-file-name<span style="color: #859900;">)</span>
                <span style="color: #859900;">(</span>sh-set-shell <span style="color: #2aa198;">"zsh"</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org93144c8" class="outline-3">
<h3 id="org93144c8"><span class="section-number-3">3.6.</span> Gnus</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Basic <a href="https://www.gnu.org/software/emacs/manual/html_node/gnus/">Gnus Newsreader</a> configuration. Enter Gnus with <code>/M-x gnus/</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> gnus-select-method '<span style="color: #2aa198;">(</span>nntp <span style="color: #2aa198;">"news.gnus.org"</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'nnhackernews<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-to-list 'gnus-secondary-select-methods '<span style="color: #2aa198;">(</span>nnhackernews <span style="color: #2aa198;">""</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Enter the <code>nnhackernews:news</code> newsgroup with <code>/RET/</code>.
</p>

<p>
And of course, more icons!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'all-the-icons-gnus<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>display-graphic-p<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">all-the-icons-gnus</span><span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span>all-the-icons-gnus-setup<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8bab607" class="outline-3">
<h3 id="org8bab607"><span class="section-number-3">3.7.</span> Remote (TRAMP) Editing</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>counsel-tramp
   docker-tramp<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> tramp-default-method <span style="color: #2aa198;">"ssh"</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0253eb" class="outline-3">
<h3 id="orgf0253eb"><span class="section-number-3">3.8.</span> Version Control</h3>
<div class="outline-text-3" id="text-3-8">
</div>
<div id="outline-container-org73d7dc0" class="outline-4">
<h4 id="org73d7dc0"><span class="section-number-4">3.8.1.</span> Core Git</h4>
<div class="outline-text-4" id="text-3-8-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>git-attr
   git-blamed
   git-link
   git-timemachine
   git-modes<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd2daea6" class="outline-4">
<h4 id="orgd2daea6"><span class="section-number-4">3.8.2.</span> Git and iBuffer</h4>
<div class="outline-text-4" id="text-3-8-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span>skj/package-install '<span style="color: #2aa198;">(</span>ibuffer-git<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org845641e" class="outline-4">
<h4 id="org845641e"><span class="section-number-4">3.8.3.</span> Git Issues</h4>
<div class="outline-text-4" id="text-3-8-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'git-commit-insert-issue<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">git-commit-insert-issue</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'git-commit-mode-hook 'git-commit-insert-issue-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org23ba418" class="outline-4">
<h4 id="org23ba418"><span class="section-number-4">3.8.4.</span> Magit</h4>
<div class="outline-text-4" id="text-3-8-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>magit
   magit-diff-flycheck
   magit-lfs
   magit-filenotify<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">magit</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> magit-completing-read-function 'ivy-completing-read<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
This package displays keyword entries from source code comments and Org files
in the Magit status buffer.  Activating an item jumps to it in its file.  By
default, it uses keywords from `hl-todo', minus a few (like "NOTE").
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'magit-todos<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">magit-todos</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>magit-todos-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga931c79" class="outline-4">
<h4 id="orga931c79"><span class="section-number-4">3.8.5.</span> Diff Highlighting</h4>
<div class="outline-text-4" id="text-3-8-5">
<p>
`diff-hl-mode' highlights uncommitted changes on the side of the
window (using the <i>fringe</i>, by default), allows you to jump between
the hunks and revert them selectively.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'diff-hl<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">diff-hl</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>global-diff-hl-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
