org-init/init.org
*** Github Integration

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Github Integration")
#+END_SRC

M-x github-explorer "txgvnn/github-explorer"

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(github
   github-browse-file
   github-explorer
   github-pullrequest
   github-review))
#+END_SRC

*** Github Bug References

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Github Bug References")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'bug-reference-github)

(require 'bug-reference-github)

(add-hook 'prog-mode-hook 'bug-reference-github-set-url-format)
#+END_SRC

*** Github Notifications

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Github Notifications")
#+END_SRC

This gets to be a pain if it is disconnected. Consider trying =gh-notify=.

#+BEGIN_SRC emacs-lisp
;; (skj/package-install 'github-notifier)
;;
;; (require 'skj-secrets)
;; 
;; (setq github-notifier-token (skj/secrets-value 'github-token))
;; 
;; (add-hook 'prog-mode-hook #'github-notifier-mode)
#+END_SRC

*** iBuffer Integration

#+BEGIN_SRC emacs-lisp
(skj/package-install 'ibuffer-vc)

(add-hook 'ibuffer-hook
          (lambda ()
            (ibuffer-vc-set-filter-groups-by-vc-root)
            (unless (eq ibuffer-sorting-mode 'alphabetic)
              (ibuffer-do-sort-by-alphabetic))))
#+END_SRC

*** Code Reviews

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Code Reviews")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'code-review)
#+END_SRC


* Snippet Support

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § Snippet Support")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defcustom
  skj/snippet-repo-dir
  (concat-path skj/project-root-dir "emacs-snippets")
  "Snippet repository local path."
  :tag "Snippet repository local path"
  :group 'skj
  :type 'directory)
#+END_SRC

** Core Snippet Support

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Core Snippet Support")
#+END_SRC

First of all, the primary snippet tool is =yasnippet=.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'yasnippet)
#+END_SRC

on changes: yas-reload-all

#+BEGIN_SRC emacs-lisp
(require 'yasnippet)

(dolist (path (list
               (concat-path user-emacs-directory "snippets")
               (concat-path org-directory "snippets")
               skj/snippet-repo-dir))
  (unless (member path yas-snippet-dirs)
    (setq yas-snippet-dirs
          (cons path yas-snippet-dirs))))

(yas-global-mode 1)

(add-hook 'prog-mode-hook #'yas-minor-mode)
#+END_SRC

** Snippet Collections

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Snippet Collections")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(yasnippet-snippets
   gitignore-snippets
   license-snippets))

(require 'gitignore-snippets)

(gitignore-snippets-init)
#+END_SRC

** Snippet Completion

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Snippet Completion")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'ivy-yasnippet)
#+END_SRC


* Org-Mode

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § Org-Mode")
#+END_SRC

The almighty [[https://orgmode.org/][Emacs Org Mode]]!

#+BEGIN_SRC emacs-lisp
(let ((org-dir (concat-path skj/project-root-dir "emacs-org")))
  (if (boundp 'org-directory)
      (setq org-directory org-dir)
    (defvar org-directory org-dir)))
#+END_SRC

The following are worth reading for more details and future ideas:

- http://doc.norang.ca/org-mode.html
- https://github.com/zzamboni/dot-emacs/blob/master/init.org
- https://orgmode.org/worg/org-tutorials/encrypting-files.html
- https://github.com/daviwil/emacs-from-scratch/blob/master/show-notes/Emacs-06.org
  (Agendas and Templates)
- https://orgmode.org/manual/Custom-Agenda-Views.html#Custom-Agenda-Views

