org-init/init.html

<div id="outline-container-org5f264fa" class="outline-4">
<h4 id="org5f264fa"><span class="section-number-4">3.8.6.</span> Github Integration</h4>
<div class="outline-text-4" id="text-3-8-6">
<p>
M-x github-explorer "txgvnn/github-explorer"
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>github
   github-browse-file
   github-explorer
   github-pullrequest
   github-review<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6a45f29" class="outline-4">
<h4 id="org6a45f29"><span class="section-number-4">3.8.7.</span> Github Bug References</h4>
<div class="outline-text-4" id="text-3-8-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'bug-reference-github<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">bug-reference-github</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'prog-mode-hook 'bug-reference-github-set-url-format<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org84ad6c3" class="outline-4">
<h4 id="org84ad6c3"><span class="section-number-4">3.8.8.</span> Github Notifications</h4>
<div class="outline-text-4" id="text-3-8-8">
<p>
This gets to be a pain if it is disconnected. Consider trying <code>gh-notify</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">(skj/package-install 'github-notifier)</span>
<span style="color: #93a1a1; font-style: italic;">;;</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">(require 'skj-secrets)</span>
<span style="color: #93a1a1; font-style: italic;">;; </span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">(setq github-notifier-token (skj/secrets-value 'github-token))</span>
<span style="color: #93a1a1; font-style: italic;">;; </span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">(add-hook 'prog-mode-hook #'github-notifier-mode)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb779744" class="outline-4">
<h4 id="orgb779744"><span class="section-number-4">3.8.9.</span> iBuffer Integration</h4>
<div class="outline-text-4" id="text-3-8-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'ibuffer-vc<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'ibuffer-hook
          <span style="color: #2aa198;">(</span><span style="color: #859900;">lambda</span> <span style="color: #b58900;">()</span>
            <span style="color: #b58900;">(</span>ibuffer-vc-set-filter-groups-by-vc-root<span style="color: #b58900;">)</span>
            <span style="color: #b58900;">(</span><span style="color: #859900;">unless</span> <span style="color: #859900;">(</span>eq ibuffer-sorting-mode 'alphabetic<span style="color: #859900;">)</span>
              <span style="color: #859900;">(</span>ibuffer-do-sort-by-alphabetic<span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc6e886b" class="outline-4">
<h4 id="orgc6e886b"><span class="section-number-4">3.8.10.</span> Code Reviews</h4>
<div class="outline-text-4" id="text-3-8-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'code-review<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org7961659" class="outline-2">
<h2 id="org7961659"><span class="section-number-2">4.</span> Snippet Support</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defcustom</span>
  skj/snippet-repo-dir
  <span style="color: #2aa198;">(</span>concat-path skj/project-root-dir <span style="color: #2aa198;">"emacs-snippets"</span><span style="color: #2aa198;">)</span>
  <span style="color: #d33682;">"Snippet repository local path."</span>
  <span style="color: #6c71c4;">:tag</span> <span style="color: #2aa198;">"Snippet repository local path"</span>
  <span style="color: #6c71c4;">:group</span> 'skj
  <span style="color: #6c71c4;">:type</span> 'directory<span style="color: #657b83;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org521a823" class="outline-3">
<h3 id="org521a823"><span class="section-number-3">4.1.</span> Core Snippet Support</h3>
<div class="outline-text-3" id="text-4-1">
<p>
First of all, the primary snippet tool is <code>yasnippet</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'yasnippet<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
on changes: yas-reload-all
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">yasnippet</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">dolist</span> <span style="color: #2aa198;">(</span>path <span style="color: #b58900;">(</span>list
               <span style="color: #859900;">(</span>concat-path user-emacs-directory <span style="color: #2aa198;">"snippets"</span><span style="color: #859900;">)</span>
               <span style="color: #859900;">(</span>concat-path org-directory <span style="color: #2aa198;">"snippets"</span><span style="color: #859900;">)</span>
               skj/snippet-repo-dir<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">unless</span> <span style="color: #b58900;">(</span>member path yas-snippet-dirs<span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span><span style="color: #859900;">setq</span> yas-snippet-dirs
          <span style="color: #859900;">(</span>cons path yas-snippet-dirs<span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>yas-global-mode 1<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'prog-mode-hook #'yas-minor-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org33aeed4" class="outline-3">
<h3 id="org33aeed4"><span class="section-number-3">4.2.</span> Snippet Collections</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>yasnippet-snippets
   gitignore-snippets
   license-snippets<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">gitignore-snippets</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>gitignore-snippets-init<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb54146" class="outline-3">
<h3 id="orgbb54146"><span class="section-number-3">4.3.</span> Snippet Completion</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'ivy-yasnippet<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orga3b5897" class="outline-2">
<h2 id="orga3b5897"><span class="section-number-2">5.</span> Org-Mode</h2>
<div class="outline-text-2" id="text-5">
<p>
The almighty <a href="https://orgmode.org/">Emacs Org Mode</a>!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">let</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span>org-dir <span style="color: #859900;">(</span>concat-path skj/project-root-dir <span style="color: #2aa198;">"emacs-org"</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">if</span> <span style="color: #b58900;">(</span>boundp 'org-directory<span style="color: #b58900;">)</span>
      <span style="color: #b58900;">(</span><span style="color: #859900;">setq</span> org-directory org-dir<span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span><span style="color: #859900;">defvar</span> <span style="color: #6c71c4;">org-directory</span> org-dir<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
The following are worth reading for more details and future ideas:
</p>

<ul class="org-ul">
<li><a href="http://doc.norang.ca/org-mode.html">http://doc.norang.ca/org-mode.html</a></li>
<li><a href="https://github.com/zzamboni/dot-emacs/blob/master/init.org">https://github.com/zzamboni/dot-emacs/blob/master/init.org</a></li>
<li><a href="https://orgmode.org/worg/org-tutorials/encrypting-files.html">https://orgmode.org/worg/org-tutorials/encrypting-files.html</a></li>
<li><a href="https://github.com/daviwil/emacs-from-scratch/blob/master/show-notes/Emacs-06.org">https://github.com/daviwil/emacs-from-scratch/blob/master/show-notes/Emacs-06.org</a>
(Agendas and Templates)</li>
<li><a href="https://orgmode.org/manual/Custom-Agenda-Views.html#Custom-Agenda-Views">https://orgmode.org/manual/Custom-Agenda-Views.html#Custom-Agenda-Views</a></li>
</ul>
</div>
