org-init/init.org
** Initial Configuration

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Initial Configuration")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'org)

(setq org-confirm-babel-evaluate nil
      org-cycle-separator-lines 2
      org-default-notes-file (concat-path org-directory "inbox.org")
      org-edit-src-content-indentation 2
      org-ellipsis " ▾"
      org-enforce-todo-dependencies t
      org-fontify-quote-and-verse-blocks t
      org-hide-emphasis-markers t
      org-image-actual-width '(550)
      org-log-done 'time
      org-log-into-drawer t
      org-src-fontify-natively t
      org-src-preserve-indentation t
      org-src-tab-acts-natively t
      org-startup-folded 'content
      org-startup-indented t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))
#+END_SRC

*** Org Query Language (ql)

#+BEGIN_SRC emacs-lisp
  (skj/package-install 'org-ql)
#+END_SRC

*** Priorities

#+BEGIN_SRC emacs-lisp
(setq org-priority-highest ?A
      org-priority-lowest ?E
      org-priority-default ?C)

(setq org-highest-priority ?A
      org-lowest-priority ?E
      org-default-priority ?C)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (skj/package-install 'org-fancy-priorities)

  (require 'org-fancy-priorities)

  (setq org-fancy-priorities-list
        '((?A . "⚡") (?B . "⬆") (?C . " ") (?D . "⬇") (?E . "☕"))
        org-priority-faces
        '((?A :foreground "red" :weight bold)
          (?B :foreground "orange" :weight semi-bold)
          (?C :foreground "green" :weight normal)
          (?B :foreground "blue" :weight semi-light)
          (?C :foreground "grey" :weight light)))

  (add-hook 'org-agenda-mode-hook 'org-fancy-priorities-mode)
#+END_SRC

