org-init/init.html

<div id="outline-container-org316937c" class="outline-3">
<h3 id="org316937c"><span class="section-number-3">5.1.</span> Initial Configuration</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">org</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-confirm-babel-evaluate nil
      org-cycle-separator-lines 2
      org-default-notes-file <span style="color: #2aa198;">(</span>concat-path org-directory <span style="color: #2aa198;">"inbox.org"</span><span style="color: #2aa198;">)</span>
      org-edit-src-content-indentation 2
      org-ellipsis <span style="color: #2aa198;">" &#9662;"</span>
      org-enforce-todo-dependencies t
      org-fontify-quote-and-verse-blocks t
      org-hide-emphasis-markers t
      org-image-actual-width '<span style="color: #2aa198;">(</span>550<span style="color: #2aa198;">)</span>
      org-log-done 'time
      org-log-into-drawer t
      org-src-fontify-natively t
      org-src-preserve-indentation t
      org-src-tab-acts-natively t
      org-startup-folded 'content
      org-startup-indented t<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>add-to-list 'auto-mode-alist '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"\\.org\\'"</span> . org-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org580b9f5" class="outline-4">
<h4 id="org580b9f5"><span class="section-number-4">5.1.1.</span> Org Query Language (ql)</h4>
<div class="outline-text-4" id="text-5-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span>skj/package-install 'org-ql<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org914c875" class="outline-4">
<h4 id="org914c875"><span class="section-number-4">5.1.2.</span> Priorities</h4>
<div class="outline-text-4" id="text-5-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-priority-highest ?A
      org-priority-lowest ?E
      org-priority-default ?C<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-highest-priority ?A
      org-lowest-priority ?E
      org-default-priority ?C<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span>skj/package-install 'org-fancy-priorities<span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">org-fancy-priorities</span><span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-fancy-priorities-list
        '<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span>?A . <span style="color: #2aa198;">"&#9889;"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>?B . <span style="color: #2aa198;">"&#11014;"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>?C . <span style="color: #2aa198;">" "</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>?D . <span style="color: #2aa198;">"&#11015;"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>?E . <span style="color: #2aa198;">"&#9749;"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
        org-priority-faces
        '<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span>?A <span style="color: #6c71c4;">:foreground</span> <span style="color: #2aa198;">"red"</span> <span style="color: #6c71c4;">:weight</span> bold<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span>?B <span style="color: #6c71c4;">:foreground</span> <span style="color: #2aa198;">"orange"</span> <span style="color: #6c71c4;">:weight</span> semi-bold<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span>?C <span style="color: #6c71c4;">:foreground</span> <span style="color: #2aa198;">"green"</span> <span style="color: #6c71c4;">:weight</span> normal<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span>?B <span style="color: #6c71c4;">:foreground</span> <span style="color: #2aa198;">"blue"</span> <span style="color: #6c71c4;">:weight</span> semi-light<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span>?C <span style="color: #6c71c4;">:foreground</span> <span style="color: #2aa198;">"grey"</span> <span style="color: #6c71c4;">:weight</span> light<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span>add-hook 'org-agenda-mode-hook 'org-fancy-priorities-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
