org-init/init.org
*** Tags

#+BEGIN_SRC emacs-lisp
  (setq org-tag-alist
        '((:startgroup)
          ("@home" . ?H) ("@travel" . ?V) ("@work" . ?W) ("@doctor" . ?D)
          (:endgroup)
        
          (:startgrouptag)
          ("generic")
          (:grouptags)
          ("idea" . ?i) ("call" . ?c) ("errand" . ?e) ("remind" . ?r)
          (:endgrouptag)
        
          (:startgrouptag)
          ("home")
          (:grouptags)
          ("fix") ("clean") ("garage") ("yard") ("family") ("friends")
          ("finance") ("estate") ("pets")
          (:endgrouptag)
        
          (:startgrouptag)
          ("home-fun")
          (:grouptags)
          ("diving" . ?d) ("hacking" . ?h) ("music" . ?m) ("synth" . ?s)
          (:endgrouptag)
        
          (:startgrouptag)
          ("work")
          (:grouptags)
          ("coding" . ?o) ("meeting" . ?m) ("planning" . ?p) ("writing" . ?w)
          ("business" . ?B) ("technical" . ?T) ("hr" . ?H)
          ("l6" . ?6) ("l7" . ?7) ("l8" . ?8) ("l10" . ?0) ("l11" . ?1)
          (:endgrouptag)))
#+END_SRC

Currently this fails!

#+BEGIN_SRC emacs-lisp
  ;; (skj/package-install 'org-tag-beautify)
  ;; (org-tag-beautify-mode 1)
#+END_SRC

#+BEGIN_EXAMPLE
all-the-icons-fileicon: Unable to find icon with name ‘svelte’ in icon set
‘fileicon’
#+END_EXAMPLE

*** Task Types (Keywords)

Specify (<char>Before/After) where either Before/After may be @ for
record time AND comment, ! for just time

#+BEGIN_SRC emacs-lisp
  (setq org-todo-keywords
        '(;; Simple reminders
          (sequence "NUDGE(g)" "|" "DONE(d!)")
          ;; General to-do items
          (sequence "TODO(t)" "NEXT(n!)" "INPROGRESS(p!)" "WAIT(w@/!)" "|" "DONE(d!)" "CANCELED(c@)")
          ;; Work-like task items
          (sequence "BACKLOG(b)" "PLAN(p!)" "READY(r!)" "ACTIVE(a@/!)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "DONE(d!)" "CANCELED(c@)")
          ;; Appointment and Meeting tracking
          (sequence "SCHEDULE(s/!)" "REQUESTED(r)" "BOOKED(b@/!)" "DEFERRED(f@/!)" "RESCHEDULE(e@/!)" "|" "DONE(d!)" "CANCELED(c@)")))

  (setq-default org-enforce-todo-dependencies t)
#+END_SRC

Edna provides an extensible means of specifying conditions which must be fulfilled before a task can be completed and actions to take once it is.

Org Edna runs when either the BLOCKER or TRIGGER properties are set on a heading, and when it is changing from a TODO state to a DONE state.

#+BEGIN_SRC emacs-lisp
  (skj/package-install 'org-edna)

  (require 'org-edna)

  (org-edna-mode)
#+END_SRC

