org-init/init.html

<div id="outline-container-org4d62cbd" class="outline-4">
<h4 id="org4d62cbd"><span class="section-number-4">5.1.3.</span> Tags</h4>
<div class="outline-text-4" id="text-5-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-tag-alist
        '<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span><span style="color: #6c71c4;">:startgroup</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"@home"</span> . ?H<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"@travel"</span> . ?V<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"@work"</span> . ?W<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"@doctor"</span> . ?D<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:endgroup</span><span style="color: #b58900;">)</span>
        
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:startgrouptag</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"generic"</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:grouptags</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"idea"</span> . ?i<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"call"</span> . ?c<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"errand"</span> . ?e<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"remind"</span> . ?r<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:endgrouptag</span><span style="color: #b58900;">)</span>
        
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:startgrouptag</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"home"</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:grouptags</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"fix"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"clean"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"garage"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"yard"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"family"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"friends"</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"finance"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"estate"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"pets"</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:endgrouptag</span><span style="color: #b58900;">)</span>
        
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:startgrouptag</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"home-fun"</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:grouptags</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"diving"</span> . ?d<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"hacking"</span> . ?h<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"music"</span> . ?m<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"synth"</span> . ?s<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:endgrouptag</span><span style="color: #b58900;">)</span>
        
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:startgrouptag</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"work"</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:grouptags</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"coding"</span> . ?o<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"meeting"</span> . ?m<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"planning"</span> . ?p<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"writing"</span> . ?w<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"business"</span> . ?B<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"technical"</span> . ?T<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"hr"</span> . ?H<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"l6"</span> . ?6<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"l7"</span> . ?7<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"l8"</span> . ?8<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"l10"</span> . ?0<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"l11"</span> . ?1<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #6c71c4;">:endgrouptag</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Currently this fails!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">(skj/package-install 'org-tag-beautify)</span>
  <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">(org-tag-beautify-mode 1)</span>
</pre>
</div>

<pre class="example" id="org8a5275c">
all-the-icons-fileicon: Unable to find icon with name svelte in icon set
fileicon
</pre>
</div>
</div>

<div id="outline-container-orgdc69099" class="outline-4">
<h4 id="orgdc69099"><span class="section-number-4">5.1.4.</span> Task Types (Keywords)</h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
Specify (&lt;char&gt;Before/After) where either Before/After may be @ for
record time AND comment, ! for just time
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-todo-keywords
        '<span style="color: #2aa198;">(</span><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Simple reminders</span>
          <span style="color: #b58900;">(</span>sequence <span style="color: #2aa198;">"NUDGE(g)"</span> <span style="color: #2aa198;">"|"</span> <span style="color: #2aa198;">"DONE(d!)"</span><span style="color: #b58900;">)</span>
          <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">General to-do items</span>
          <span style="color: #b58900;">(</span>sequence <span style="color: #2aa198;">"TODO(t)"</span> <span style="color: #2aa198;">"NEXT(n!)"</span> <span style="color: #2aa198;">"INPROGRESS(p!)"</span> <span style="color: #2aa198;">"WAIT(w@/!)"</span> <span style="color: #2aa198;">"|"</span> <span style="color: #2aa198;">"DONE(d!)"</span> <span style="color: #2aa198;">"CANCELED(c@)"</span><span style="color: #b58900;">)</span>
          <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Work-like task items</span>
          <span style="color: #b58900;">(</span>sequence <span style="color: #2aa198;">"BACKLOG(b)"</span> <span style="color: #2aa198;">"PLAN(p!)"</span> <span style="color: #2aa198;">"READY(r!)"</span> <span style="color: #2aa198;">"ACTIVE(a@/!)"</span> <span style="color: #2aa198;">"REVIEW(v)"</span> <span style="color: #2aa198;">"WAIT(w@/!)"</span> <span style="color: #2aa198;">"HOLD(h)"</span> <span style="color: #2aa198;">"|"</span> <span style="color: #2aa198;">"DONE(d!)"</span> <span style="color: #2aa198;">"CANCELED(c@)"</span><span style="color: #b58900;">)</span>
          <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Appointment and Meeting tracking</span>
          <span style="color: #b58900;">(</span>sequence <span style="color: #2aa198;">"SCHEDULE(s/!)"</span> <span style="color: #2aa198;">"REQUESTED(r)"</span> <span style="color: #2aa198;">"BOOKED(b@/!)"</span> <span style="color: #2aa198;">"DEFERRED(f@/!)"</span> <span style="color: #2aa198;">"RESCHEDULE(e@/!)"</span> <span style="color: #2aa198;">"|"</span> <span style="color: #2aa198;">"DONE(d!)"</span> <span style="color: #2aa198;">"CANCELED(c@)"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span><span style="color: #859900;">setq-default</span> org-enforce-todo-dependencies t<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Edna provides an extensible means of specifying conditions which must be fulfilled before a task can be completed and actions to take once it is.
</p>

<p>
Org Edna runs when either the BLOCKER or TRIGGER properties are set on a heading, and when it is changing from a TODO state to a DONE state.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span>skj/package-install 'org-edna<span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">org-edna</span><span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span>org-edna-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
