org-init/init.org
*** Capture Templates

#+BEGIN_SRC emacs-lisp
  (setq org-capture-templates
        '(("t" "Todo" entry (file+headline org-default-notes-file "Inbox")
           "* TODO %?\n%u\n%a\n" :clock-in t :clock-resume t)
          ("m" "Meeting" entry (file+headline org-default-notes-file "Inbox")
           "* MEETING with %? :MEETING:\n%t" :clock-in t :clock-resume t)
          ("i" "Idea" entry (file+headline org-default-notes-file "Inbox")
           "* %? :IDEA: \n%t" :clock-in t :clock-resume t)
          ("n" "Next Task" entry (file+headline org-default-notes-file "Inbox")
           "** NEXT %? \nDEADLINE: %t")
          ("d" "Distraction" entry (file+headline
                                    (concat org-directory "/distractions.org")
                                    "Distractions")
           "* %?\n%T")))
#+END_SRC

*** Faces

#+BEGIN_SRC emacs-lisp
  (setq org-todo-keyword-faces
        '(("NEXT" . (:foreground "green" :weight bold))
          ("PLAN" . (:foreground "green" :weight bold))
          ("INPROGRESS" . (:foreground "blue" :weight bold))
          ("ACTIVE" . (:foreground "blue" :weight bold))))

  (add-hook 'org-mode-hook #'turn-on-font-lock)
#+END_SRC

*** Project File Integration

Adds all TODO items from a =todo.org= file in the magit project's root
to the magit status buffer.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'magit-org-todos)

(require 'magit-org-todos)

(magit-org-todos-autoinsert)
#+END_SRC

** Core UI Additions

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Core UI Additions")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(org-beautify-theme
   org-modern
   org-sidebar
   org-superstar))
#+END_SRC

Use /=C-c C-s=/ to use a relative time for schedule.

#+BEGIN_SRC emacs-lisp :exports none
(skj/package-install 'orgbox)
#+END_SRC

*** Notifications

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Notifications")
#+END_SRC

Provides notifications for scheduled or deadlined agenda entries. This uses
the =alert= package configured in [[#core-ui-notifications]] above.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'org-alert)

(require 'org-alert)

(setq org-alert-interval 300
      org-alert-notify-cutoff 10
      org-alert-notify-after-event-cutoff 10
      org-alert-notification-title "Org Agenda")
#+END_SRC

*** Prettier Bullets

#+BEGIN_SRC emacs-lisp
(skj/package-install 'org-bullets)

(require 'org-bullets)

(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+END_SRC

