org-init/init.html

<div id="outline-container-org344e322" class="outline-4">
<h4 id="org344e322"><span class="section-number-4">5.1.5.</span> Capture Templates</h4>
<div class="outline-text-4" id="text-5-1-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-capture-templates
        '<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">"t"</span> <span style="color: #2aa198;">"Todo"</span> entry <span style="color: #859900;">(</span>file+headline org-default-notes-file <span style="color: #2aa198;">"Inbox"</span><span style="color: #859900;">)</span>
           <span style="color: #2aa198;">"* TODO %?\n%u\n%a\n"</span> <span style="color: #6c71c4;">:clock-in</span> t <span style="color: #6c71c4;">:clock-resume</span> t<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"m"</span> <span style="color: #2aa198;">"Meeting"</span> entry <span style="color: #859900;">(</span>file+headline org-default-notes-file <span style="color: #2aa198;">"Inbox"</span><span style="color: #859900;">)</span>
           <span style="color: #2aa198;">"* MEETING with %? :MEETING:\n%t"</span> <span style="color: #6c71c4;">:clock-in</span> t <span style="color: #6c71c4;">:clock-resume</span> t<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"i"</span> <span style="color: #2aa198;">"Idea"</span> entry <span style="color: #859900;">(</span>file+headline org-default-notes-file <span style="color: #2aa198;">"Inbox"</span><span style="color: #859900;">)</span>
           <span style="color: #2aa198;">"* %? :IDEA: \n%t"</span> <span style="color: #6c71c4;">:clock-in</span> t <span style="color: #6c71c4;">:clock-resume</span> t<span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"n"</span> <span style="color: #2aa198;">"Next Task"</span> entry <span style="color: #859900;">(</span>file+headline org-default-notes-file <span style="color: #2aa198;">"Inbox"</span><span style="color: #859900;">)</span>
           <span style="color: #2aa198;">"** NEXT %? \nDEADLINE: %t"</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"d"</span> <span style="color: #2aa198;">"Distraction"</span> entry <span style="color: #859900;">(</span>file+headline
                                    <span style="color: #268bd2;">(</span>concat org-directory <span style="color: #2aa198;">"/distractions.org"</span><span style="color: #268bd2;">)</span>
                                    <span style="color: #2aa198;">"Distractions"</span><span style="color: #859900;">)</span>
           <span style="color: #2aa198;">"* %?\n%T"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org73f4c37" class="outline-4">
<h4 id="org73f4c37"><span class="section-number-4">5.1.6.</span> Faces</h4>
<div class="outline-text-4" id="text-5-1-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-todo-keyword-faces
        '<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">"NEXT"</span> . <span style="color: #859900;">(</span><span style="color: #6c71c4;">:foreground</span> <span style="color: #2aa198;">"green"</span> <span style="color: #6c71c4;">:weight</span> bold<span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"PLAN"</span> . <span style="color: #859900;">(</span><span style="color: #6c71c4;">:foreground</span> <span style="color: #2aa198;">"green"</span> <span style="color: #6c71c4;">:weight</span> bold<span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"INPROGRESS"</span> . <span style="color: #859900;">(</span><span style="color: #6c71c4;">:foreground</span> <span style="color: #2aa198;">"blue"</span> <span style="color: #6c71c4;">:weight</span> bold<span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
          <span style="color: #b58900;">(</span><span style="color: #2aa198;">"ACTIVE"</span> . <span style="color: #859900;">(</span><span style="color: #6c71c4;">:foreground</span> <span style="color: #2aa198;">"blue"</span> <span style="color: #6c71c4;">:weight</span> bold<span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span>add-hook 'org-mode-hook #'turn-on-font-lock<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org231c600" class="outline-4">
<h4 id="org231c600"><span class="section-number-4">5.1.7.</span> Project File Integration</h4>
<div class="outline-text-4" id="text-5-1-7">
<p>
Adds all TODO items from a <code>todo.org</code> file in the magit project's root
to the magit status buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'magit-org-todos<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">magit-org-todos</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>magit-org-todos-autoinsert<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc879a56" class="outline-3">
<h3 id="orgc879a56"><span class="section-number-3">5.2.</span> Core UI Additions</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>org-beautify-theme
   org-modern
   org-sidebar
   org-superstar<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Use <i><code>C-c C-s</code></i> to use a relative time for schedule.
</p>
</div>

<div id="outline-container-orgc0ebc87" class="outline-4">
<h4 id="orgc0ebc87"><span class="section-number-4">5.2.1.</span> Notifications</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
Provides notifications for scheduled or deadlined agenda entries. This uses
the <code>alert</code> package configured in <a href="#core-ui-notifications">3.1.6</a> above.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'org-alert<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">org-alert</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-alert-interval 300
      org-alert-notify-cutoff 10
      org-alert-notify-after-event-cutoff 10
      org-alert-notification-title <span style="color: #2aa198;">"Org Agenda"</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org55e1bd8" class="outline-4">
<h4 id="org55e1bd8"><span class="section-number-4">5.2.2.</span> Prettier Bullets</h4>
<div class="outline-text-4" id="text-5-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'org-bullets<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">org-bullets</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'org-mode-hook <span style="color: #2aa198;">(</span><span style="color: #859900;">lambda</span> <span style="color: #b58900;">()</span> <span style="color: #b58900;">(</span>org-bullets-mode 1<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>
