org-init/init.org
** Agenda

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Agenda")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(org-agenda-property
   org-super-agenda))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'org-agenda)

(setq org-agenda-files
      (list (concat org-directory "/inbox.org")
            (concat org-directory "/notes.org")
            (concat org-directory "/gcal.org")
            (concat org-directory "/birthdays.org")
            (concat org-directory "/holidays.org"))
      org-agenda-hide-tags-regexp "."
      org-agenda-log-mode-items '(closed clock state))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun skj/org-skip-subtree-if-priority (priority)
  "Skip an agenda subtree if it has a priority of PRIORITY.
  
  PRIORITY must be an integer 1 <= p <= 5."
  (let ((subtree-end (save-excursion (org-end-of-subtree t)))
        (pri-current (org-get-priority (thing-at-point 'line t))))
    (if (= priority pri-current)
        subtree-end
      nil)))

(defun skj/org-skip-subtree-if-habit ()
  "Skip an agenda entry if it has a STYLE property equal to \"habit\"."
  (let ((subtree-end (save-excursion (org-end-of-subtree t))))
    (if (string= (org-entry-get nil "STYLE") "habit")
        subtree-end
      nil)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq org-agenda-custom-commands
      '(("m"
         "ALL Meetings"
         ((tags "CATEGORY=\"Meetings\""
                ((org-agenda-overriding-header "Meetings:")
                 (org-tags-match-list-sublevels t)))))
        ("d"
         "Daily agenda review"
         ((tags "PRIORITY=1"
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "High-priority unfinished tasks:")))
          (agenda "")
          (alltodo ""
                   ((org-agenda-skip-function
                     '(or (skj/org-skip-subtree-if-priority 1)
                          (org-agenda-skip-if nil '(scheduled deadline)))))))
         nil
         ("~/daily-agenda.html"))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq org-columns-default-format-for-agenda
      (string-join '("%35ITEM(Task)"
                     "%10TODO(State)"
                     "%3PRIORITY(P)"
                     "%30ALLTAGS(All Tags)"
                     "%23SCHEDULED(Scheduled to Start)"
                     "%22DEADLINE(Deadline)"
                     "%6EFFORT(Effort){:}")
                   " "))
#+END_SRC

Basically, if you don't touch Emacs =idle-org-agenda= will display your
org-agenda after certain time. That can be useful to remember tasks after come
back to work.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'idle-org-agenda)

(require 'idle-org-agenda)

(idle-org-agenda-mode)
#+END_SRC

*** Clock Tracking

#+BEGIN_SRC emacs-lisp
(setq org-clock-persist 'history
      org-remember-clock-out-on-exit t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'org-clock-reminder)

(require 'org-clock-reminder)

(org-clock-reminder-mode)
#+END_SRC

By default, notifications (active, inactive) are shown every 10 minutes

#+BEGIN_SRC emacs-lisp
(setq org-clock-reminder-interval 10)
#+END_SRC

Active notifications are shown every 3 minute, inactive every 3

#+BEGIN_SRC emacs-lisp
(setq org-clock-reminder-interval (cons 3 10))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'org-pomodoro)
(setq org-pomodoro-manual-break t)
#+END_SRC

