org-init/init.html

<div id="outline-container-org0a98213" class="outline-3">
<h3 id="org0a98213"><span class="section-number-3">5.3.</span> Agenda</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>org-agenda-property
   org-super-agenda<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">org-agenda</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-agenda-files
      <span style="color: #2aa198;">(</span>list <span style="color: #b58900;">(</span>concat org-directory <span style="color: #2aa198;">"/inbox.org"</span><span style="color: #b58900;">)</span>
            <span style="color: #b58900;">(</span>concat org-directory <span style="color: #2aa198;">"/notes.org"</span><span style="color: #b58900;">)</span>
            <span style="color: #b58900;">(</span>concat org-directory <span style="color: #2aa198;">"/gcal.org"</span><span style="color: #b58900;">)</span>
            <span style="color: #b58900;">(</span>concat org-directory <span style="color: #2aa198;">"/birthdays.org"</span><span style="color: #b58900;">)</span>
            <span style="color: #b58900;">(</span>concat org-directory <span style="color: #2aa198;">"/holidays.org"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
      org-agenda-hide-tags-regexp <span style="color: #2aa198;">"."</span>
      org-agenda-log-mode-items '<span style="color: #2aa198;">(</span>closed clock state<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">skj/org-skip-subtree-if-priority</span> <span style="color: #2aa198;">(</span>priority<span style="color: #2aa198;">)</span>
  <span style="color: #d33682;">"Skip an agenda subtree if it has a priority of PRIORITY.</span>
<span style="color: #d33682;">  </span>
<span style="color: #d33682;">  PRIORITY must be an integer 1 &lt;= p &lt;= 5."</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">let</span> <span style="color: #b58900;">(</span><span style="color: #859900;">(</span>subtree-end <span style="color: #268bd2;">(</span><span style="color: #859900;">save-excursion</span> <span style="color: #657b83;">(</span>org-end-of-subtree t<span style="color: #657b83;">)</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>pri-current <span style="color: #268bd2;">(</span>org-get-priority <span style="color: #657b83;">(</span>thing-at-point 'line t<span style="color: #657b83;">)</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span><span style="color: #859900;">if</span> <span style="color: #859900;">(</span>= priority pri-current<span style="color: #859900;">)</span>
        subtree-end
      nil<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">skj/org-skip-subtree-if-habit</span> <span style="color: #2aa198;">()</span>
  <span style="color: #d33682;">"Skip an agenda entry if it has a STYLE property equal to \"habit\"."</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">let</span> <span style="color: #b58900;">(</span><span style="color: #859900;">(</span>subtree-end <span style="color: #268bd2;">(</span><span style="color: #859900;">save-excursion</span> <span style="color: #657b83;">(</span>org-end-of-subtree t<span style="color: #657b83;">)</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span><span style="color: #859900;">if</span> <span style="color: #859900;">(</span>string= <span style="color: #268bd2;">(</span>org-entry-get nil <span style="color: #2aa198;">"STYLE"</span><span style="color: #268bd2;">)</span> <span style="color: #2aa198;">"habit"</span><span style="color: #859900;">)</span>
        subtree-end
      nil<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-agenda-custom-commands
      '<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">"m"</span>
         <span style="color: #2aa198;">"ALL Meetings"</span>
         <span style="color: #859900;">(</span><span style="color: #268bd2;">(</span>tags <span style="color: #2aa198;">"CATEGORY=\"Meetings\""</span>
                <span style="color: #657b83;">(</span><span style="color: #2aa198;">(</span>org-agenda-overriding-header <span style="color: #2aa198;">"Meetings:"</span><span style="color: #2aa198;">)</span>
                 <span style="color: #2aa198;">(</span>org-tags-match-list-sublevels t<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
        <span style="color: #b58900;">(</span><span style="color: #2aa198;">"d"</span>
         <span style="color: #2aa198;">"Daily agenda review"</span>
         <span style="color: #859900;">(</span><span style="color: #268bd2;">(</span>tags <span style="color: #2aa198;">"PRIORITY=1"</span>
                <span style="color: #657b83;">(</span><span style="color: #2aa198;">(</span>org-agenda-skip-function '<span style="color: #b58900;">(</span>org-agenda-skip-entry-if 'todo 'done<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
                 <span style="color: #2aa198;">(</span>org-agenda-overriding-header <span style="color: #2aa198;">"High-priority unfinished tasks:"</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span><span style="color: #268bd2;">)</span>
          <span style="color: #268bd2;">(</span>agenda <span style="color: #2aa198;">""</span><span style="color: #268bd2;">)</span>
          <span style="color: #268bd2;">(</span>alltodo <span style="color: #2aa198;">""</span>
                   <span style="color: #657b83;">(</span><span style="color: #2aa198;">(</span>org-agenda-skip-function
                     '<span style="color: #b58900;">(</span>or <span style="color: #859900;">(</span>skj/org-skip-subtree-if-priority 1<span style="color: #859900;">)</span>
                          <span style="color: #859900;">(</span>org-agenda-skip-if nil '<span style="color: #657b83;">(</span>scheduled deadline<span style="color: #657b83;">)</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span>
         nil
         <span style="color: #859900;">(</span><span style="color: #2aa198;">"~/daily-agenda.html"</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-columns-default-format-for-agenda
      <span style="color: #2aa198;">(</span>string-join '<span style="color: #b58900;">(</span><span style="color: #2aa198;">"%35ITEM(Task)"</span>
                     <span style="color: #2aa198;">"%10TODO(State)"</span>
                     <span style="color: #2aa198;">"%3PRIORITY(P)"</span>
                     <span style="color: #2aa198;">"%30ALLTAGS(All Tags)"</span>
                     <span style="color: #2aa198;">"%23SCHEDULED(Scheduled to Start)"</span>
                     <span style="color: #2aa198;">"%22DEADLINE(Deadline)"</span>
                     <span style="color: #2aa198;">"%6EFFORT(Effort){:}"</span><span style="color: #b58900;">)</span>
                   <span style="color: #2aa198;">" "</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Basically, if you don't touch Emacs <code>idle-org-agenda</code> will display your
org-agenda after certain time. That can be useful to remember tasks after come
back to work.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'idle-org-agenda<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">idle-org-agenda</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>idle-org-agenda-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orgad33d17" class="outline-4">
<h4 id="orgad33d17"><span class="section-number-4">5.3.1.</span> Clock Tracking</h4>
<div class="outline-text-4" id="text-5-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-clock-persist 'history
      org-remember-clock-out-on-exit t<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'org-clock-reminder<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">org-clock-reminder</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>org-clock-reminder-mode<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
By default, notifications (active, inactive) are shown every 10 minutes
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-clock-reminder-interval 10<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Active notifications are shown every 3 minute, inactive every 3
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-clock-reminder-interval <span style="color: #2aa198;">(</span>cons 3 10<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'org-pomodoro<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-pomodoro-manual-break t<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
