org-init/init.org
*** Habit Tracking

#+BEGIN_SRC emacs-lisp
(skj/package-install 'org-habit-stats)

(require 'org-habit)

(add-to-list 'org-modules 'org-habit t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq org-habit-following-days 7
      org-habit-graph-column 60
      org-habit-preceding-days 28
      org-habit-show-all-today t
      org-habit-show-done-always-green t
      org-habit-show-habits-only-for-today t)
#+END_SRC

*** Standard Calendars

#+BEGIN_SRC emacs-lisp
(customize-set-variable 'holiday-bahai-holidays nil)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'mexican-holidays)

(require 'mexican-holidays)

(setq calendar-holidays
      (append calendar-holidays holiday-mexican-holidays))
#+END_SRC

*** Google Calendar

#+BEGIN_SRC emacs-lisp
(require 'skj-secrets)

(setq org-gcal-client-id (skj/secrets-value 'gcal-id))
(setq org-gcal-client-secret (skj/secrets-value 'gcal-secret))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'org-gcal)

(require 'org-gcal)

(defcustom skj/org-gcal-file
  (concat org-directory "/gcal.org")
  "Location of `org-mode' file to sync with Google Calendar."
  :tag "Org file for Google Calendar"
  :group 'skj
  :type 'file)

(setq org-gcal-fetch-file-alist
	  (list (cons skj/primary-email skj/org-gcal-file)))
#+END_SRC

TODO: Use calendar TZ

#+BEGIN_SRC emacs-lisp
(setq org-gcal-local-timezone calendar-time-zone-name)
#+END_SRC

Execute /=M-x org-gcal-fetch=/ to fetch new calendar updates

Execute /=M-x org-gcal-post-at-point=/ to turn a TODO into a calendar entry

*** Appointment Integration

#+BEGIN_SRC emacs-lisp
(require 'appt)

(setq appt-audible t
	  appt-display-duration 30
	  appt-display-format 'window
	  appt-display-mode-line t)
#+END_SRC

Activate appointments so we get notifications
#+BEGIN_SRC emacs-lisp
(appt-activate t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun skj-org-agenda-to-appt ()
  "Erase all reminders and rebuilt reminders for today from the agenda."
  (interactive)
  (setq appt-time-msg-list nil)
  (org-agenda-to-appt))
#+END_SRC

Rebuild the reminders everytime the agenda is displayed
 
#+BEGIN_SRC emacs-lisp
(add-hook 'org-agenda-finalize-hook 'skj-org-agenda-to-appt 'append)
#+END_SRC

If we leave Emacs running overnight - reset the appointments one minute after midnight

#+BEGIN_SRC emacs-lisp
(run-at-time "24:01" nil 'skj-org-agenda-to-appt)
#+END_SRC

 Run now so appointments are set up when Emacs starts
 
#+BEGIN_SRC emacs-lisp
(skj-org-agenda-to-appt)
#+END_SRC

** Babel

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Babel")
#+END_SRC

Always redisplay images after =C-c C-c=

#+BEGIN_SRC emacs-lisp
(skj/package-install 'ob-latex-as-png)

(add-hook 'org-babel-after-execute-hook 'org-redisplay-inline-images)
#+END_SRC

*** GraphViz

#+BEGIN_SRC emacs-lisp
(skj/package-install 'graphviz-dot-mode)

(require 'graphviz-dot-mode)

(unless (version<= emacs-version "26")
  (setq graphviz-dot-indent-width tab-width))

(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((dot . t))) ; this line activates dot
#+END_SRC

*** PlantUML

#+BEGIN_SRC emacs-lisp
(skj/package-install 'plantuml-mode)

(setq org-plantuml-jar-path
      (expand-file-name "/usr/local/Cellar/plantuml/1.2022.6/libexec/plantuml.jar"))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((plantuml . t))) ; this line activates plantuml

(skj/package-install 'flycheck-plantuml)

(require 'flycheck-plantuml)

(flycheck-plantuml-setup)
#+END_SRC

** Other Stuff

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Other Stuff")
#+END_SRC

*** References

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(org-ref
   org-ref-prettify))
#+END_SRC

