org-init/init.html

<div id="outline-container-org9141f7c" class="outline-4">
<h4 id="org9141f7c"><span class="section-number-4">5.3.2.</span> Habit Tracking</h4>
<div class="outline-text-4" id="text-5-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'org-habit-stats<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">org-habit</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-to-list 'org-modules 'org-habit t<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-habit-following-days 7
      org-habit-graph-column 60
      org-habit-preceding-days 28
      org-habit-show-all-today t
      org-habit-show-done-always-green t
      org-habit-show-habits-only-for-today t<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org558c7cc" class="outline-4">
<h4 id="org558c7cc"><span class="section-number-4">5.3.3.</span> Standard Calendars</h4>
<div class="outline-text-4" id="text-5-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>customize-set-variable 'holiday-bahai-holidays nil<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'mexican-holidays<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">mexican-holidays</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> calendar-holidays
      <span style="color: #2aa198;">(</span>append calendar-holidays holiday-mexican-holidays<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e66cf4" class="outline-4">
<h4 id="org5e66cf4"><span class="section-number-4">5.3.4.</span> Google Calendar</h4>
<div class="outline-text-4" id="text-5-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">skj-secrets</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-gcal-client-id <span style="color: #2aa198;">(</span>skj/secrets-value 'gcal-id<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-gcal-client-secret <span style="color: #2aa198;">(</span>skj/secrets-value 'gcal-secret<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'org-gcal<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">org-gcal</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">defcustom</span> <span style="color: #6c71c4;">skj/org-gcal-file</span>
  <span style="color: #2aa198;">(</span>concat org-directory <span style="color: #2aa198;">"/gcal.org"</span><span style="color: #2aa198;">)</span>
  <span style="color: #d33682;">"Location of `</span><span style="color: #268bd2;">org-mode</span><span style="color: #d33682;">' file to sync with Google Calendar."</span>
  <span style="color: #6c71c4;">:tag</span> <span style="color: #2aa198;">"Org file for Google Calendar"</span>
  <span style="color: #6c71c4;">:group</span> 'skj
  <span style="color: #6c71c4;">:type</span> 'file<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-gcal-fetch-file-alist
      <span style="color: #2aa198;">(</span>list <span style="color: #b58900;">(</span>cons skj/primary-email skj/org-gcal-file<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
TODO: Use calendar TZ
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-gcal-local-timezone calendar-time-zone-name<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Execute <i><code>M-x org-gcal-fetch</code></i> to fetch new calendar updates
</p>

<p>
Execute <i><code>M-x org-gcal-post-at-point</code></i> to turn a TODO into a calendar entry
</p>
</div>
</div>

<div id="outline-container-org64bdf08" class="outline-4">
<h4 id="org64bdf08"><span class="section-number-4">5.3.5.</span> Appointment Integration</h4>
<div class="outline-text-4" id="text-5-3-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">appt</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> appt-audible t
      appt-display-duration 30
      appt-display-format 'window
      appt-display-mode-line t<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Activate appointments so we get notifications
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>appt-activate t<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">skj-org-agenda-to-appt</span> <span style="color: #2aa198;">()</span>
  <span style="color: #d33682;">"Erase all reminders and rebuilt reminders for today from the agenda."</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">interactive</span><span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">setq</span> appt-time-msg-list nil<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span>org-agenda-to-appt<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Rebuild the reminders everytime the agenda is displayed
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>add-hook 'org-agenda-finalize-hook 'skj-org-agenda-to-appt 'append<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
If we leave Emacs running overnight - reset the appointments one minute after midnight
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>run-at-time <span style="color: #2aa198;">"24:01"</span> nil 'skj-org-agenda-to-appt<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Run now so appointments are set up when Emacs starts
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj-org-agenda-to-appt<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org91f4647" class="outline-3">
<h3 id="org91f4647"><span class="section-number-3">5.4.</span> Babel</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Always redisplay images after <code>C-c C-c</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'ob-latex-as-png<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'org-babel-after-execute-hook 'org-redisplay-inline-images<span style="color: #657b83;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org914484d" class="outline-4">
<h4 id="org914484d"><span class="section-number-4">5.4.1.</span> GraphViz</h4>
<div class="outline-text-4" id="text-5-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'graphviz-dot-mode<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">graphviz-dot-mode</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">unless</span> <span style="color: #2aa198;">(</span>version&lt;= emacs-version <span style="color: #2aa198;">"26"</span><span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">setq</span> graphviz-dot-indent-width tab-width<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'org-babel-after-execute-hook 'org-display-inline-images<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>org-babel-do-load-languages
 'org-babel-load-languages
 '<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span>dot . t<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span> <span style="color: #93a1a1; font-style: italic;">; </span><span style="color: #93a1a1; font-style: italic;">this line activates dot</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org89f26a1" class="outline-4">
<h4 id="org89f26a1"><span class="section-number-4">5.4.2.</span> PlantUML</h4>
<div class="outline-text-4" id="text-5-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'plantuml-mode<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-plantuml-jar-path
      <span style="color: #2aa198;">(</span>expand-file-name <span style="color: #2aa198;">"/usr/local/Cellar/plantuml/1.2022.6/libexec/plantuml.jar"</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>org-babel-do-load-languages
 'org-babel-load-languages
 '<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span>plantuml . t<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span> <span style="color: #93a1a1; font-style: italic;">; </span><span style="color: #93a1a1; font-style: italic;">this line activates plantuml</span>

<span style="color: #657b83;">(</span>skj/package-install 'flycheck-plantuml<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">flycheck-plantuml</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>flycheck-plantuml-setup<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgaafbb17" class="outline-3">
<h3 id="orgaafbb17"><span class="section-number-3">5.5.</span> Other Stuff</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-orga0895f3" class="outline-4">
<h4 id="orga0895f3"><span class="section-number-4">5.5.1.</span> References</h4>
<div class="outline-text-4" id="text-5-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>org-ref
   org-ref-prettify<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
