org-init/init.org
*** Exporting

#+BEGIN_SRC emacs-lisp
(skj/package-install '(ox-md ox-gfm ox-wk))
#+END_SRC

*** Refile and Archive

#+BEGIN_SRC emacs-lisp
(setq org-refile-targets (quote ((nil :maxlevel . 9)
                                 (org-agenda-files :maxlevel . 9)
                                 ("archive.org" :maxlevel . 1))))
#+END_SRC

Save Org buffers after refiling.

#+BEGIN_SRC emacs-lisp
(advice-add 'org-refile :after 'org-save-all-org-buffers)
#+END_SRC

*** Completion Integration

#+BEGIN_SRC emacs-lisp
  (skj/package-install 'company-org-block)

  (require 'company-org-block)

  (setq company-org-block-edit-style 'auto) ;; 'auto, 'prompt, or 'inline

  (add-hook 'org-mode-hook
            (lambda ()
              (add-to-list (make-local-variable 'company-backends)
                           'company-org-block)))
  (skj/package-install
     '(org-ivy-search
       ivy-omni-org
       ivy-todo))
#+END_SRC

** Key Bindings

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Key Bindings")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c l") #'org-store-link)
(global-set-key (kbd "C-c a") #'org-agenda)
(global-set-key (kbd "C-c c") #'org-capture)

(global-set-key (kbd "<f5>") 'org-agenda)
(global-set-key (kbd "C-<f5>") 'org-store-agenda-views)

(global-set-key (kbd "<f6> i") 'org-clock-in)
(global-set-key (kbd "<f6> o") 'org-clock-out)
(global-set-key (kbd "<f6> g") 'org-clock-goto)
(global-set-key (kbd "<f6> <f6>") 'org-clock-menu)

(global-set-key (kbd "C-c p") 'org-pomodoro)
#+END_SRC


* Other Writing Modes

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § Other Writing Modes")
#+END_SRC

** Focus Mode

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Focus Mode")
#+END_SRC

For distraction-free editing, use the command /=M-x focus-mode=/ which will dim
all but the block of text/code you are currently within.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'focus)
#+END_SRC

** Emoji Support

#+BEGIN_SRC emacs-lisp :exports none
  (message "INIT: § ▶ ⁋ Emoji Support")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'company-emoji)
   
(when (display-graphic-p)
  (add-to-list 'company-backends 'company-emoji)
  
  (defun --set-emoji-font (frame)
    "Adjust the font settings of FRAME so Emacs can display emoji properly."
    (if (system-mac-p)
        ;; For NS/Cocoa
        (set-fontset-font t 'symbol (font-spec :family "Apple Color Emoji") frame 'prepend)
      ;; For Linux
      (set-fontset-font t 'symbol (font-spec :family "Symbola") frame 'prepend)))
  
  ;; For when Emacs is started in GUI mode:
  (--set-emoji-font nil)
  ;; Hook for when a frame is created with emacsclient
  ;; see https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Frames.html
  (add-hook 'after-make-frame-functions '--set-emoji-font))
#+END_SRC

** Markdown

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Markdown")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install '(markdown-mode markdown-mode+))

(autoload 'markdown-mode "markdown-mode"
  "Major mode for editing Markdown files" t)
(add-to-list 'auto-mode-alist '("\\.markdown\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))

(autoload 'gfm-mode "markdown-mode"
  "Major mode for editing GitHub Flavored Markdown files" t)
(add-to-list 'auto-mode-alist '("README\\.md\\'" . gfm-mode))
#+END_SRC

