org-init/init.html

<div id="outline-container-org4580e0f" class="outline-4">
<h4 id="org4580e0f"><span class="section-number-4">5.5.2.</span> Exporting</h4>
<div class="outline-text-4" id="text-5-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install '<span style="color: #2aa198;">(</span>ox-md ox-gfm ox-wk<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org19eccc1" class="outline-4">
<h4 id="org19eccc1"><span class="section-number-4">5.5.3.</span> Refile and Archive</h4>
<div class="outline-text-4" id="text-5-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-refile-targets <span style="color: #2aa198;">(</span><span style="color: #859900;">quote</span> <span style="color: #b58900;">(</span><span style="color: #859900;">(</span>nil <span style="color: #6c71c4;">:maxlevel</span> . 9<span style="color: #859900;">)</span>
                                 <span style="color: #859900;">(</span>org-agenda-files <span style="color: #6c71c4;">:maxlevel</span> . 9<span style="color: #859900;">)</span>
                                 <span style="color: #859900;">(</span><span style="color: #2aa198;">"archive.org"</span> <span style="color: #6c71c4;">:maxlevel</span> . 1<span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Save Org buffers after refiling.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>advice-add 'org-refile <span style="color: #6c71c4;">:after</span> 'org-save-all-org-buffers<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgde5c5b5" class="outline-4">
<h4 id="orgde5c5b5"><span class="section-number-4">5.5.4.</span> Completion Integration</h4>
<div class="outline-text-4" id="text-5-5-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #657b83;">(</span>skj/package-install 'company-org-block<span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">company-org-block</span><span style="color: #657b83;">)</span>

  <span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> company-org-block-edit-style 'auto<span style="color: #657b83;">)</span> <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">'auto, 'prompt, or 'inline</span>

  <span style="color: #657b83;">(</span>add-hook 'org-mode-hook
            <span style="color: #2aa198;">(</span><span style="color: #859900;">lambda</span> <span style="color: #b58900;">()</span>
              <span style="color: #b58900;">(</span>add-to-list <span style="color: #859900;">(</span>make-local-variable 'company-backends<span style="color: #859900;">)</span>
                           'company-org-block<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
  <span style="color: #657b83;">(</span>skj/package-install
     '<span style="color: #2aa198;">(</span>org-ivy-search
       ivy-omni-org
       ivy-todo<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org65d0f0b" class="outline-3">
<h3 id="org65d0f0b"><span class="section-number-3">5.6.</span> Key Bindings</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c l"</span><span style="color: #2aa198;">)</span> #'org-store-link<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c a"</span><span style="color: #2aa198;">)</span> #'org-agenda<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c c"</span><span style="color: #2aa198;">)</span> #'org-capture<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"&lt;f5&gt;"</span><span style="color: #2aa198;">)</span> 'org-agenda<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-&lt;f5&gt;"</span><span style="color: #2aa198;">)</span> 'org-store-agenda-views<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"&lt;f6&gt; i"</span><span style="color: #2aa198;">)</span> 'org-clock-in<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"&lt;f6&gt; o"</span><span style="color: #2aa198;">)</span> 'org-clock-out<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"&lt;f6&gt; g"</span><span style="color: #2aa198;">)</span> 'org-clock-goto<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"&lt;f6&gt; &lt;f6&gt;"</span><span style="color: #2aa198;">)</span> 'org-clock-menu<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c p"</span><span style="color: #2aa198;">)</span> 'org-pomodoro<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orga21dc41" class="outline-2">
<h2 id="orga21dc41"><span class="section-number-2">6.</span> Other Writing Modes</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org9ee9618" class="outline-3">
<h3 id="org9ee9618"><span class="section-number-3">6.1.</span> Focus Mode</h3>
<div class="outline-text-3" id="text-6-1">
<p>
For distraction-free editing, use the command <i><code>M-x focus-mode</code></i> which will dim
all but the block of text/code you are currently within.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'focus<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc807f34" class="outline-3">
<h3 id="orgc807f34"><span class="section-number-3">6.2.</span> Emoji Support</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'company-emoji<span style="color: #657b83;">)</span>
   
<span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>display-graphic-p<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span>add-to-list 'company-backends 'company-emoji<span style="color: #2aa198;">)</span>
  
  <span style="color: #2aa198;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">--set-emoji-font</span> <span style="color: #b58900;">(</span>frame<span style="color: #b58900;">)</span>
    <span style="color: #d33682;">"Adjust the font settings of FRAME so Emacs can display emoji properly."</span>
    <span style="color: #b58900;">(</span><span style="color: #859900;">if</span> <span style="color: #859900;">(</span>system-mac-p<span style="color: #859900;">)</span>
        <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">For NS/Cocoa</span>
        <span style="color: #859900;">(</span>set-fontset-font t 'symbol <span style="color: #268bd2;">(</span>font-spec <span style="color: #6c71c4;">:family</span> <span style="color: #2aa198;">"Apple Color Emoji"</span><span style="color: #268bd2;">)</span> frame 'prepend<span style="color: #859900;">)</span>
      <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">For Linux</span>
      <span style="color: #859900;">(</span>set-fontset-font t 'symbol <span style="color: #268bd2;">(</span>font-spec <span style="color: #6c71c4;">:family</span> <span style="color: #2aa198;">"Symbola"</span><span style="color: #268bd2;">)</span> frame 'prepend<span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
  
  <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">For when Emacs is started in GUI mode:</span>
  <span style="color: #2aa198;">(</span>--set-emoji-font nil<span style="color: #2aa198;">)</span>
  <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">Hook for when a frame is created with emacsclient</span>
  <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">see https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Frames.html</span>
  <span style="color: #2aa198;">(</span>add-hook 'after-make-frame-functions '--set-emoji-font<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fef278" class="outline-3">
<h3 id="org8fef278"><span class="section-number-3">6.3.</span> Markdown</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install '<span style="color: #2aa198;">(</span>markdown-mode markdown-mode+<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>autoload 'markdown-mode <span style="color: #2aa198;">"markdown-mode"</span>
  <span style="color: #d33682;">"Major mode for editing Markdown files"</span> t<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-to-list 'auto-mode-alist '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"\\.markdown\\'"</span> . markdown-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-to-list 'auto-mode-alist '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"\\.md\\'"</span> . markdown-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>autoload 'gfm-mode <span style="color: #2aa198;">"markdown-mode"</span>
  <span style="color: #d33682;">"Major mode for editing GitHub Flavored Markdown files"</span> t<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-to-list 'auto-mode-alist '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"README\\.md\\'"</span> . gfm-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
