org-init/init.org
** Blogging

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Blogging")
#+END_SRC

Editing jekyll files, using =polymode= for the mix of YAML and Markdown.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'poly-markdown)
(skj/package-install 'jekyll-modes)

;;(require 'jekyll-markdown-mode)
;;(add-to-list 'auto-mode-alist '("\\.md$" . jekyll-markdown-mode))
#+END_SRC

Emacs major mode for managing [[https://jekyllrb.com/][jekyll]] blogs ([[https://github.com/masasam/emacs-easy-jekyll][repo]]).

#+BEGIN_SRC emacs-lisp
(skj/package-install 'easy-jekyll)
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; thanks to https://cute-jumper.github.io/emacs/2013/10/06/orgmode-to-github-pages-with-jekyll
(defun org-jekyll-post-link-follow (path)
  (org-open-file-with-emacs path))

(defun org-jekyll-post-link-export (path desc format)
  (cond
   ((eq format 'html)
    (format "<a href=\"{%% post_url %s %%}\">%s</a>" (file-name-sans-extension path) desc))))

(org-add-link-type "jekyll-post" 'org-jekyll-post-link-follow 'org-jekyll-post-link-export)
#+END_SRC

** LaTeX

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ LaTeX")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(auctex
   auctex-latexmk
   
   latex-pretty-symbols
   latex-extra
   
   biblio
   bibretrieve
   bibtex-utils))

(add-hook 'LaTeX-mode-hook #'latex-extra-mode)

(setq latex-run-command "xelatex"
      TeX-auto-save t
      TeX-parse-self t)
#+END_SRC

Backends for =company-mode= providing auto-completion for [[https://www.gnu.org/software/auctex/][AUCTeX]].

#+BEGIN_SRC emacs-lisp
(skj/package-install 'company-auctex)

(require ''company-auctex)

('company-auctex-init)
#+END_SRC

Use /=M-x latex-math-preview-expression=/

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(latex-math-preview ;
   latex-preview-pane))

(latex-preview-pane-enable)
#+END_SRC

** Spell and Style Checking

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Spell and Style Checking")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'auto-dictionary)

(require 'auto-dictionary)

(add-hook 'flyspell-mode-hook (lambda () (auto-dictionary-mode 1)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'flyspell-correct-ivy)

(require 'flyspell)

(setq flyspell-issue-message-flag nil
	  ispell-program-name "aspell")

(let* ((env-language (getenv "LANG"))
	   (dictionary (first (split-string env-language "\\."))))
  (setq ispell-extra-args (list (concat "--lang=" dictionary))))

(add-hook 'text-mode-hook 'flyspell-mode)
(add-hook 'prog-mode-hook 'flyspell-prog-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'smog)      ;; check writing style: M-x smog-check-buffer

(require 'smog)

(setq smog-command "style -L en")
#+END_SRC

** LaTeX Completion

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ LaTeX Completion")
#+END_SRC

This is a group of backends for =company-mode= providing auto-completion for
AUCTeX.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'company-auctex)

(require 'company-auctex)

(company-auctex-init)
#+END_SRC

This add-on defines three =company-mode= backends.

#+BEGIN_SRC emacs-lisp
(skj/package-install company-math)

(require 'company-math)

(setq company-tooltip-align-annotations t)

;; global activation of the unicode symbol completion
(add-to-list 'company-backends 'company-math-symbols-unicode)
#+END_SRC

** Bibliography Completion

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Bibliography")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install '(company-bibtex ivy-bibtex ))

(require 'company-bibtex)

(add-to-list 'company-backends 'company-bibtex)
#+END_SRC


* Developer Configuration

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § Developer Configuration")
#+END_SRC

** UI Settings
