org-init/init.html

<div id="outline-container-org0f90dde" class="outline-3">
<h3 id="org0f90dde"><span class="section-number-3">6.4.</span> Blogging</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Editing jekyll files, using <code>polymode</code> for the mix of YAML and Markdown.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'poly-markdown<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>skj/package-install 'jekyll-modes<span style="color: #657b83;">)</span>

<span style="color: #93a1a1; font-style: italic;">;;</span><span style="color: #93a1a1; font-style: italic;">(require 'jekyll-markdown-mode)</span>
<span style="color: #93a1a1; font-style: italic;">;;</span><span style="color: #93a1a1; font-style: italic;">(add-to-list 'auto-mode-alist '("\\.md$" . jekyll-markdown-mode))</span>
</pre>
</div>

<p>
Emacs major mode for managing <a href="https://jekyllrb.com/">jekyll</a> blogs (<a href="https://github.com/masasam/emacs-easy-jekyll">repo</a>).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'easy-jekyll<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">thanks to https://cute-jumper.github.io/emacs/2013/10/06/orgmode-to-github-pages-with-jekyll</span>
<span style="color: #657b83;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">org-jekyll-post-link-follow</span> <span style="color: #2aa198;">(</span>path<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span>org-open-file-with-emacs path<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">org-jekyll-post-link-export</span> <span style="color: #2aa198;">(</span>path desc format<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">cond</span>
   <span style="color: #b58900;">(</span><span style="color: #859900;">(</span>eq format 'html<span style="color: #859900;">)</span>
    <span style="color: #859900;">(</span>format <span style="color: #2aa198;">"&lt;a href=\"{%% post_url %s %%}\"&gt;%s&lt;/a&gt;"</span> <span style="color: #268bd2;">(</span>file-name-sans-extension path<span style="color: #268bd2;">)</span> desc<span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>org-add-link-type <span style="color: #2aa198;">"jekyll-post"</span> 'org-jekyll-post-link-follow 'org-jekyll-post-link-export<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org02f4259" class="outline-3">
<h3 id="org02f4259"><span class="section-number-3">6.5.</span> LaTeX</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>auctex
   auctex-latexmk
   
   latex-pretty-symbols
   latex-extra
   
   biblio
   bibretrieve
   bibtex-utils<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'LaTeX-mode-hook #'latex-extra-mode<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> latex-run-command <span style="color: #2aa198;">"xelatex"</span>
      TeX-auto-save t
      TeX-parse-self t<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Backends for <code>company-mode</code> providing auto-completion for <a href="https://www.gnu.org/software/auctex/">AUCTeX</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'company-auctex<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> ''<span style="color: #268bd2;">company-auctex</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>'company-auctex-init<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Use <i><code>M-x latex-math-preview-expression</code></i>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>latex-math-preview <span style="color: #93a1a1; font-style: italic;">;</span>
   latex-preview-pane<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>latex-preview-pane-enable<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2406a0" class="outline-3">
<h3 id="orgb2406a0"><span class="section-number-3">6.6.</span> Spell and Style Checking</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'auto-dictionary<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">auto-dictionary</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'flyspell-mode-hook <span style="color: #2aa198;">(</span><span style="color: #859900;">lambda</span> <span style="color: #b58900;">()</span> <span style="color: #b58900;">(</span>auto-dictionary-mode 1<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'flyspell-correct-ivy<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">flyspell</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> flyspell-issue-message-flag nil
      ispell-program-name <span style="color: #2aa198;">"aspell"</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">let*</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span>env-language <span style="color: #859900;">(</span>getenv <span style="color: #2aa198;">"LANG"</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
       <span style="color: #b58900;">(</span>dictionary <span style="color: #859900;">(</span>first <span style="color: #268bd2;">(</span>split-string env-language <span style="color: #2aa198;">"\\."</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">setq</span> ispell-extra-args <span style="color: #b58900;">(</span>list <span style="color: #859900;">(</span>concat <span style="color: #2aa198;">"--lang="</span> dictionary<span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'text-mode-hook 'flyspell-mode<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-hook 'prog-mode-hook 'flyspell-prog-mode<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'smog<span style="color: #657b83;">)</span>      <span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">check writing style: M-x smog-check-buffer</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">smog</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> smog-command <span style="color: #2aa198;">"style -L en"</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc2fb8b0" class="outline-3">
<h3 id="orgc2fb8b0"><span class="section-number-3">6.7.</span> LaTeX Completion</h3>
<div class="outline-text-3" id="text-6-7">
<p>
This is a group of backends for <code>company-mode</code> providing auto-completion for
AUCTeX.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'company-auctex<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">company-auctex</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>company-auctex-init<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
This add-on defines three <code>company-mode</code> backends.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install company-math<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">company-math</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> company-tooltip-align-annotations t<span style="color: #657b83;">)</span>

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">global activation of the unicode symbol completion</span>
<span style="color: #657b83;">(</span>add-to-list 'company-backends 'company-math-symbols-unicode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga63250b" class="outline-3">
<h3 id="orga63250b"><span class="section-number-3">6.8.</span> Bibliography Completion</h3>
<div class="outline-text-3" id="text-6-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install '<span style="color: #2aa198;">(</span>company-bibtex ivy-bibtex <span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">company-bibtex</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-to-list 'company-backends 'company-bibtex<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org2520f7a" class="outline-2">
<h2 id="org2520f7a"><span class="section-number-2">7.</span> Developer Configuration</h2>
<div class="outline-text-2" id="text-7">
</div>
