org-init/init.org
*** Prettify Things

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Prettify Things")
#+END_SRC

Emacs 24.4 comes with a builtin =prettify-symbols-mode=. It can be customized by
changing =prettify-symbols-alist=.

#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook #'prettify-symbols-mode)
#+END_SRC

The packages =prettify-math= and =prettify-greek= extend the configuration above.
The math package requires we set the delimiters before the module loaded.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'prettify-math)

(setq prettify-math-delimiters-alist
      '(("$" tex)
        ("$$" tex block)
        (("\\(" . "\\)") tex block)
        ("`" asciimath)
        ("``" asciimath block)))

(require 'prettify-math)

(skj/package-install 'prettify-greek)

(require 'prettify-greek)

(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (setq prettify-symbols-alist prettify-greek-lower)
            (prettify-symbols-mode t)))
#+END_SRC

=fira-code-mode= is a simple minor mode for [[Fira Code][https://github.com/tonsky/FiraCode]]
ligatures.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'fira-code-mode)

;; (fira-code-mode-install-fonts)

(when (display-graphic-p)
  (require 'fira-code-mode)
  
  (fira-code-mode-set-font)
  
  (add-hook 'prog-mode-hook 'fira-code-mode))
#+END_SRC

*** Delimiters/Parenthesis

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Delimiters/Parenthesis")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(smartparens
   rainbow-delimiters))

(add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
#+END_SRC

*** Indentation

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Indentation")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(aggressive-indent
   highlight-indent-guides
   smart-tabs-mode))

(require 'aggressive-indent)

(add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode)
(add-hook 'css-mode-hook #'aggressive-indent-mode)

(require 'highlight-indent-guides)

(setq
 highlight-indent-guides-method 'character
 highlight-indent-guides-responsive 'stack)

(set-face-foreground 'highlight-indent-guides-character-face "brightmagenta")

(add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
#+END_SRC

*** Completion

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Completion")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'company)

(setq company-files-exclusions '(".git/" ".DS_Store"))
(setq company-tooltip-align-annotations t)

(add-hook 'web-mode-hook
          (lambda ()
            (set (make-local-variable 'company-backends) '(company-web-html))
            (company-mode t)))
#+END_SRC

*** Odds & Ends

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Odds & Ends")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'hl-todo)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'subword)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'eldoc)

(add-hook 'prog-mode-hook 'turn-on-eldoc-mode)
#+END_SRC

** Project Support
