org-init/init.html
<div id="outline-container-org594463e" class="outline-3">
<h3 id="org594463e"><span class="section-number-3">7.1.</span> UI Settings</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orgc57feed" class="outline-4">
<h4 id="orgc57feed"><span class="section-number-4">7.1.1.</span> Prettify Things</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
Emacs 24.4 comes with a builtin <code>prettify-symbols-mode</code>. It can be customized by
changing <code>prettify-symbols-alist</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>add-hook 'prog-mode-hook #'prettify-symbols-mode<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
The packages <code>prettify-math</code> and <code>prettify-greek</code> extend the configuration above.
The math package requires we set the delimiters before the module loaded.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'prettify-math<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> prettify-math-delimiters-alist
      '<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">"$"</span> tex<span style="color: #b58900;">)</span>
        <span style="color: #b58900;">(</span><span style="color: #2aa198;">"$$"</span> tex block<span style="color: #b58900;">)</span>
        <span style="color: #b58900;">(</span><span style="color: #859900;">(</span><span style="color: #2aa198;">"</span><span style="color: #6c71c4;">\\</span><span style="color: #d33682;">(</span><span style="color: #2aa198;">"</span> . <span style="color: #2aa198;">"</span><span style="color: #6c71c4;">\\</span><span style="color: #d33682;">)</span><span style="color: #2aa198;">"</span><span style="color: #859900;">)</span> tex block<span style="color: #b58900;">)</span>
        <span style="color: #b58900;">(</span><span style="color: #2aa198;">"`"</span> asciimath<span style="color: #b58900;">)</span>
        <span style="color: #b58900;">(</span><span style="color: #2aa198;">"``"</span> asciimath block<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">prettify-math</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>skj/package-install 'prettify-greek<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">prettify-greek</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'emacs-lisp-mode-hook
          <span style="color: #2aa198;">(</span><span style="color: #859900;">lambda</span> <span style="color: #b58900;">()</span>
            <span style="color: #b58900;">(</span><span style="color: #859900;">setq</span> prettify-symbols-alist prettify-greek-lower<span style="color: #b58900;">)</span>
            <span style="color: #b58900;">(</span>prettify-symbols-mode t<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
<code>fira-code-mode</code> is a simple minor mode for <a href="https://github.com/tonsky/FiraCode">Fira Code</a>
ligatures.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'fira-code-mode<span style="color: #657b83;">)</span>

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">(fira-code-mode-install-fonts)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>display-graphic-p<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">fira-code-mode</span><span style="color: #2aa198;">)</span>
  
  <span style="color: #2aa198;">(</span>fira-code-mode-set-font<span style="color: #2aa198;">)</span>
  
  <span style="color: #2aa198;">(</span>add-hook 'prog-mode-hook 'fira-code-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ef7360" class="outline-4">
<h4 id="org8ef7360"><span class="section-number-4">7.1.2.</span> Delimiters/Parenthesis</h4>
<div class="outline-text-4" id="text-7-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>smartparens
   rainbow-delimiters<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'prog-mode-hook #'rainbow-delimiters-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge681be3" class="outline-4">
<h4 id="orge681be3"><span class="section-number-4">7.1.3.</span> Indentation</h4>
<div class="outline-text-4" id="text-7-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>aggressive-indent
   highlight-indent-guides
   smart-tabs-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">aggressive-indent</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-hook 'css-mode-hook #'aggressive-indent-mode<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">highlight-indent-guides</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span>
 highlight-indent-guides-method 'character
 highlight-indent-guides-responsive 'stack<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>set-face-foreground 'highlight-indent-guides-character-face <span style="color: #2aa198;">"brightmagenta"</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'prog-mode-hook 'highlight-indent-guides-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7324f3d" class="outline-4">
<h4 id="org7324f3d"><span class="section-number-4">7.1.4.</span> Completion</h4>
<div class="outline-text-4" id="text-7-1-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">company</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> company-files-exclusions '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">".git/"</span> <span style="color: #2aa198;">".DS_Store"</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> company-tooltip-align-annotations t<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'web-mode-hook
          <span style="color: #2aa198;">(</span><span style="color: #859900;">lambda</span> <span style="color: #b58900;">()</span>
            <span style="color: #b58900;">(</span>set <span style="color: #859900;">(</span>make-local-variable 'company-backends<span style="color: #859900;">)</span> '<span style="color: #859900;">(</span>company-web-html<span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
            <span style="color: #b58900;">(</span>company-mode t<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4470ddc" class="outline-4">
<h4 id="org4470ddc"><span class="section-number-4">7.1.5.</span> Odds &amp; Ends</h4>
<div class="outline-text-4" id="text-7-1-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'hl-todo<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'subword<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'eldoc<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'prog-mode-hook 'turn-on-eldoc-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga7da52d" class="outline-3">
<h3 id="orga7da52d"><span class="section-number-3">7.2.</span> Project Support</h3>
<div class="outline-text-3" id="text-7-2">
</div>
