org-init/init.org
*** Projectile

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Projectile")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(projectile
   projectile-git-autofetch
   projectile-ripgrep

   project-explorer
   project-persist
   find-file-in-project

   counsel-projectile
   flycheck-projectile))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'projectile)

(setq projectile-completion-system 'ivy
      projectile-require-project-root t
      projectile-project-search-path
      (mapcar (lambda (p)
                (concat (file-name-as-directory skj/project-root-dir) p))
              '("emacs-little-packages" "racket" "rust" "Amazon")))
#+END_SRC

Recommended keymap prefix on macOS

#+BEGIN_SRC emacs-lisp
(when (system-mac-p)
  (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(counsel-projectile-mode 1)
(projectile-mode +1)
#+END_SRC

*** iBuffer Integration

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ iBuffer Integration")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install '(ibuffer-projectile))

(require 'ibuffer-projectile)

(add-hook 'ibuffer-hook
          (lambda ()
            (ibuffer-projectile-set-filter-groups)
            (unless (eq ibuffer-sorting-mode 'alphabetic)
              (ibuffer-do-sort-by-alphabetic))))
#+END_SRC

*** Project Explorer

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Project Explorer")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'project-explorer)

(setq pe/filenotify-enabled t
      pe/inline-folders t
      pe/omit-gitignore t
      pe/side 'left
      pe/width 40)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "<f8>") 'project-explorer-toggle)
#+END_SRC

** Language Server (Generic)

- Documentation: https://emacs-lsp.github.io/lsp-mode/
- Supported language servers: https://emacs-lsp.github.io/lsp-mode/page/languages/

#+BEGIN_SRC emacs-lisp
(skj/package-install 'lsp-mode)

(require 'lsp)

(setq lsp-eldoc-render-all t
      lsp-idle-delay 0.6)
#+END_SRC

This package contains all the higher level UI modules of =lsp-mode=, like
flycheck support and code lenses.
 
#+BEGIN_SRC emacs-lisp
(skj/package-install 'lsp-ui)

(require 'lsp-ui)

(setq  lsp-ui-doc-enable nil
       lsp-ui-doc-position 'bottom
       lsp-ui-peek-always-show t
       lsp-ui-sideline-enable nil
       lsp-ui-sideline-show-hover t)

(add-hook 'lsp-mode-hook 'lsp-ui-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
;;;###autoload
(defun skj-imenu-toggle-maybe-lsp ()
  "Toggle an imenu list popup; it will use lsp-ui if it is enabled."
  (interactive)
  (if (bound-and-true-p lsp-mode)
	  (lsp-ui-imenu)
    (imenu-list-smart-toggle)))
#+END_SRC

This package provides an interactive =ivy= interface to the workspace symbol
functionality offered by =lsp-mode=.

#+BEGIN_SRC emacs-lisp :exports none
(skj/package-install 'lsp-ivy)
#+END_SRC

*Key Bindings/Commands*

- =completion-at-point= for completions
- Signatures when writing methods (=/C-n/=, ==/C-p/== to cycle signatures)
- =lsp-find-definition=: =/C-c l g r/=
- =lsp-find-references=: =/C-c l g g/=
- =lsp-rename=: =/C-c l r r/=
- =lsp-format-buffer=: =/C-c l = ==/=
- =lsp-ui-peek-find-references= to show references inline (=/M-n/=, =/M-p/= to cycle)

** Test and Debug

#+BEGIN_SRC emacs-lisp
(skj/package-install 'dap-mode)
#+END_SRC

*** Mode Settings

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Mode Settings")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'dap-mode)

(setq dap-auto-configure-features '(sessions locals controls tooltip))
#+END_SRC

