org-init/init.html
<div id="outline-container-org763c7a3" class="outline-4">
<h4 id="org763c7a3"><span class="section-number-4">7.2.1.</span> Projectile</h4>
<div class="outline-text-4" id="text-7-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>projectile
   projectile-git-autofetch
   projectile-ripgrep

   project-explorer
   project-persist
   find-file-in-project

   counsel-projectile
   flycheck-projectile<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">projectile</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> projectile-completion-system 'ivy
      projectile-require-project-root t
      projectile-project-search-path
      <span style="color: #2aa198;">(</span>mapcar <span style="color: #b58900;">(</span><span style="color: #859900;">lambda</span> <span style="color: #859900;">(</span>p<span style="color: #859900;">)</span>
                <span style="color: #859900;">(</span>concat <span style="color: #268bd2;">(</span>file-name-as-directory skj/project-root-dir<span style="color: #268bd2;">)</span> p<span style="color: #859900;">)</span><span style="color: #b58900;">)</span>
              '<span style="color: #b58900;">(</span><span style="color: #2aa198;">"emacs-little-packages"</span> <span style="color: #2aa198;">"racket"</span> <span style="color: #2aa198;">"rust"</span> <span style="color: #2aa198;">"Amazon"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Recommended keymap prefix on macOS
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">when</span> <span style="color: #2aa198;">(</span>system-mac-p<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span>define-key projectile-mode-map <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"s-p"</span><span style="color: #b58900;">)</span> 'projectile-command-map<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>counsel-projectile-mode 1<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>projectile-mode +1<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0e3f4a4" class="outline-4">
<h4 id="org0e3f4a4"><span class="section-number-4">7.2.2.</span> iBuffer Integration</h4>
<div class="outline-text-4" id="text-7-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install '<span style="color: #2aa198;">(</span>ibuffer-projectile<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">ibuffer-projectile</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'ibuffer-hook
          <span style="color: #2aa198;">(</span><span style="color: #859900;">lambda</span> <span style="color: #b58900;">()</span>
            <span style="color: #b58900;">(</span>ibuffer-projectile-set-filter-groups<span style="color: #b58900;">)</span>
            <span style="color: #b58900;">(</span><span style="color: #859900;">unless</span> <span style="color: #859900;">(</span>eq ibuffer-sorting-mode 'alphabetic<span style="color: #859900;">)</span>
              <span style="color: #859900;">(</span>ibuffer-do-sort-by-alphabetic<span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9f44542" class="outline-4">
<h4 id="org9f44542"><span class="section-number-4">7.2.3.</span> Project Explorer</h4>
<div class="outline-text-4" id="text-7-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">project-explorer</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> pe/filenotify-enabled t
      pe/inline-folders t
      pe/omit-gitignore t
      pe/side 'left
      pe/width 40<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"&lt;f8&gt;"</span><span style="color: #2aa198;">)</span> 'project-explorer-toggle<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org49ad720" class="outline-3">
<h3 id="org49ad720"><span class="section-number-3">7.3.</span> Language Server (Generic)</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>Documentation: <a href="https://emacs-lsp.github.io/lsp-mode/">https://emacs-lsp.github.io/lsp-mode/</a></li>
<li>Supported language servers: <a href="https://emacs-lsp.github.io/lsp-mode/page/languages/">https://emacs-lsp.github.io/lsp-mode/page/languages/</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'lsp-mode<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">lsp</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> lsp-eldoc-render-all t
      lsp-idle-delay 0.6<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
This package contains all the higher level UI modules of <code>lsp-mode</code>, like
flycheck support and code lenses.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'lsp-ui<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">lsp-ui</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span>  lsp-ui-doc-enable nil
       lsp-ui-doc-position 'bottom
       lsp-ui-peek-always-show t
       lsp-ui-sideline-enable nil
       lsp-ui-sideline-show-hover t<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'lsp-mode-hook 'lsp-ui-mode<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #93a1a1; font-style: italic;">;;;</span><span style="color: #93a1a1; font-style: italic;">###</span><span style="color: #dc322f; font-weight: bold; font-style: italic;">autoload</span>
<span style="color: #657b83;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">skj-imenu-toggle-maybe-lsp</span> <span style="color: #2aa198;">()</span>
  <span style="color: #d33682;">"Toggle an imenu list popup; it will use lsp-ui if it is enabled."</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">interactive</span><span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">if</span> <span style="color: #b58900;">(</span><span style="color: #859900;">bound-and-true-p</span> lsp-mode<span style="color: #b58900;">)</span>
      <span style="color: #b58900;">(</span>lsp-ui-imenu<span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span>imenu-list-smart-toggle<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
This package provides an interactive <code>ivy</code> interface to the workspace symbol
functionality offered by <code>lsp-mode</code>.
</p>

<p>
<b>Key Bindings/Commands</b>
</p>

<ul class="org-ul">
<li><code>completion-at-point</code> for completions</li>
<li>Signatures when writing methods (<code>/C-n/</code>, <code>=/C-p/=</code> to cycle signatures)</li>
<li><code>lsp-find-definition</code>: <code>/C-c l g r/</code></li>
<li><code>lsp-find-references</code>: <code>/C-c l g g/</code></li>
<li><code>lsp-rename</code>: <code>/C-c l r r/</code></li>
<li><code>lsp-format-buffer</code>: <code>/C-c l = ==/</code></li>
<li><code>lsp-ui-peek-find-references</code> to show references inline (<code>/M-n/</code>, <code>/M-p/</code> to cycle)</li>
</ul>
</div>
</div>

<div id="outline-container-orgf188ed1" class="outline-3">
<h3 id="orgf188ed1"><span class="section-number-3">7.4.</span> Test and Debug</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'dap-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orgf605487" class="outline-4">
<h4 id="orgf605487"><span class="section-number-4">7.4.1.</span> Mode Settings</h4>
<div class="outline-text-4" id="text-7-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">dap-mode</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> dap-auto-configure-features '<span style="color: #2aa198;">(</span>sessions locals controls tooltip<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
