org-init/init.org
*** UI Settings

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ UI Settings")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'dap-ui)

(setq dap-ui-controls-mode 1)

(dap-ui-mode 1)

;; enables mouse hover support
(dap-tooltip-mode 1)

;; use tooltips for mouse hover
;; if it is not enabled `dap-mode' will use the minibuffer.
(tooltip-mode 1)

;; displays floating panel with debug buttons
(dap-ui-controls-mode 1)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(counsel-test coverlay))
#+END_SRC

** Data Formats

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(pcsv
   csv-mode
   json-mode
   toml
   toml-mode
   yaml-mode
   flycheck-yamllint))
#+END_SRC

** Language Environments

*** Emacs Lisp

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Emacs Lisp")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(package-lint
   flycheck-package))

(require 'checkdoc)
(add-hook 'emacs-lisp-mode-hook 'checkdoc-minor-mode)
#+END_SRC

*** Common Lisp

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Common Lisp")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(slime
   slime-company
   slime-repl-ansi-color
   elisp-slime-nav))

(setq inferior-lisp-program (locate-file "sbcl" exec-path))
#+END_SRC

*** Scheme

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Scheme")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(geiser
   geiser-chez
   geiser-gauche
   geiser-racket
   geiser-repl
   macrostep-geiser
   lsp-scheme
   quack
   scheme-complete))

(require 'geiser-mode)
(add-hook 'geiser-mode-hook #'macrostep-geiser-setup)

(require 'geiser-repl)
(add-hook 'geiser-repl-mode-hook #'macrostep-geiser-setup)

(require 'lsp-scheme)
(add-hook 'scheme-mode-hook #'lsp-gambit-scheme)
#+END_SRC

*** Racket

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Racket")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(dr-racket-like-unicode
   racket-mode
   scribble-mode))
#+END_SRC

*** Rust Language

#+BEGIN_SRC emacs-lisp :exports none
  ((message "message" format-args)essage "INIT: § ▶ ⁋ Rust Language")
#+END_SRC

See: <https://github.com/rust-lang/rust-mode>

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(cargo-mode
   rust-auto-use
   rust-playground
   rustic))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'rustic)

(setq rustic-babel-format-src-block t
      rustic-babel-auto-wrap-main t
      rustic-format-on-save t
      rustic-lsp-server 'rust-analyzer)

(setq lsp-rust-analyzer-cargo-load-out-dirs-from-check t
      lsp-rust-analyzer-cargo-watch-enable t
      lsp-rust-analyzer-cargo-watch-command "clippy"
      lsp-rust-analyzer-display-chaining-hints t
      lsp-rust-analyzer-display-closure-return-type-hints t
      lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil
      lsp-rust-analyzer-display-parameter-hints t
      lsp-rust-analyzer-display-reborrow-hints t
      lsp-rust-analyzer-inlay-hints-mode t
      lsp-rust-analyzer-proc-macro-enable t
      lsp-rust-analyzer-server-display-inlay-hints t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(dap-register-debug-template
 "Rust::GDB Run Configuration"
 (list :type "gdb"
       :request "launch"
       :name "GDB::Run"
       :gdbpath "rust-gdb"
       :target nil
       :cwd nil))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun rustic-mode-auto-save-hook ()
  "Enable auto-saving in rustic-mode buffers."
  (when buffer-file-name
    (setq-local compilation-ask-about-save nil)))

(add-hook 'rustic-mode-hook 'rustic-mode-auto-save-hook)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(add-hook 'rust-mode-hook 'subword-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'lsp-lens)

(add-hook 'rustic-mode-hook 'lsp-lens-mode)
#+END_SRC

Flycheck

#+BEGIN_SRC emacs-lisp
(skj/package-install 'flycheck-rust)

(require 'flycheck)

(setq flycheck-rustic-clippy-executable "cargo-clippy")

(unless (member 'rustic-clippy flycheck-checkers)
  (setq flycheck-checkers (cons 'rustic-clippy flycheck-checkers)))
#+END_SRC

Org-Babel Integration

#+BEGIN_SRC emacs-lisp
(skj/package-install 'ob-rust)
#+END_SRC

*** PEST Mode

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ PEST Mode")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(flycheck-pest
   pest-mode))
#+END_SRC

