org-init/init.html

<div id="outline-container-orgce1c775" class="outline-4">
<h4 id="orgce1c775"><span class="section-number-4">7.4.2.</span> UI Settings</h4>
<div class="outline-text-4" id="text-7-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">dap-ui</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> dap-ui-controls-mode 1<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>dap-ui-mode 1<span style="color: #657b83;">)</span>

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">enables mouse hover support</span>
<span style="color: #657b83;">(</span>dap-tooltip-mode 1<span style="color: #657b83;">)</span>

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">use tooltips for mouse hover</span>
<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">if it is not enabled `</span><span style="color: #268bd2; font-style: italic;">dap-mode</span><span style="color: #93a1a1; font-style: italic;">' will use the minibuffer.</span>
<span style="color: #657b83;">(</span>tooltip-mode 1<span style="color: #657b83;">)</span>

<span style="color: #93a1a1; font-style: italic;">;; </span><span style="color: #93a1a1; font-style: italic;">displays floating panel with debug buttons</span>
<span style="color: #657b83;">(</span>dap-ui-controls-mode 1<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>counsel-test coverlay<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1452d26" class="outline-3">
<h3 id="org1452d26"><span class="section-number-3">7.5.</span> Data Formats</h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>pcsv
   csv-mode
   json-mode
   toml
   toml-mode
   yaml-mode
   flycheck-yamllint<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbcdb085" class="outline-3">
<h3 id="orgbcdb085"><span class="section-number-3">7.6.</span> Language Environments</h3>
<div class="outline-text-3" id="text-7-6">
</div>
<div id="outline-container-orgd57be0f" class="outline-4">
<h4 id="orgd57be0f"><span class="section-number-4">7.6.1.</span> Emacs Lisp</h4>
<div class="outline-text-4" id="text-7-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>package-lint
   flycheck-package<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">checkdoc</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-hook 'emacs-lisp-mode-hook 'checkdoc-minor-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4550d75" class="outline-4">
<h4 id="org4550d75"><span class="section-number-4">7.6.2.</span> Common Lisp</h4>
<div class="outline-text-4" id="text-7-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>slime
   slime-company
   slime-repl-ansi-color
   elisp-slime-nav<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> inferior-lisp-program <span style="color: #2aa198;">(</span>locate-file <span style="color: #2aa198;">"sbcl"</span> exec-path<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0233544" class="outline-4">
<h4 id="org0233544"><span class="section-number-4">7.6.3.</span> Scheme</h4>
<div class="outline-text-4" id="text-7-6-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>geiser
   geiser-chez
   geiser-gauche
   geiser-racket
   geiser-repl
   macrostep-geiser
   lsp-scheme
   quack
   scheme-complete<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">geiser-mode</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-hook 'geiser-mode-hook #'macrostep-geiser-setup<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">geiser-repl</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-hook 'geiser-repl-mode-hook #'macrostep-geiser-setup<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">lsp-scheme</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-hook 'scheme-mode-hook #'lsp-gambit-scheme<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgddd381d" class="outline-4">
<h4 id="orgddd381d"><span class="section-number-4">7.6.4.</span> Racket</h4>
<div class="outline-text-4" id="text-7-6-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>dr-racket-like-unicode
   racket-mode
   scribble-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga3aafe4" class="outline-4">
<h4 id="orga3aafe4"><span class="section-number-4">7.6.5.</span> Rust Language</h4>
<div class="outline-text-4" id="text-7-6-5">
<p>
See: <a href="https://github.com/rust-lang/rust-mode">https://github.com/rust-lang/rust-mode</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>cargo-mode
   rust-auto-use
   rust-playground
   rustic<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">rustic</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> rustic-babel-format-src-block t
      rustic-babel-auto-wrap-main t
      rustic-format-on-save t
      rustic-lsp-server 'rust-analyzer<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> lsp-rust-analyzer-cargo-load-out-dirs-from-check t
      lsp-rust-analyzer-cargo-watch-enable t
      lsp-rust-analyzer-cargo-watch-command <span style="color: #2aa198;">"clippy"</span>
      lsp-rust-analyzer-display-chaining-hints t
      lsp-rust-analyzer-display-closure-return-type-hints t
      lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil
      lsp-rust-analyzer-display-parameter-hints t
      lsp-rust-analyzer-display-reborrow-hints t
      lsp-rust-analyzer-inlay-hints-mode t
      lsp-rust-analyzer-proc-macro-enable t
      lsp-rust-analyzer-server-display-inlay-hints t<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>dap-register-debug-template
 <span style="color: #2aa198;">"Rust::GDB Run Configuration"</span>
 <span style="color: #2aa198;">(</span>list <span style="color: #6c71c4;">:type</span> <span style="color: #2aa198;">"gdb"</span>
       <span style="color: #6c71c4;">:request</span> <span style="color: #2aa198;">"launch"</span>
       <span style="color: #6c71c4;">:name</span> <span style="color: #2aa198;">"GDB::Run"</span>
       <span style="color: #6c71c4;">:gdbpath</span> <span style="color: #2aa198;">"rust-gdb"</span>
       <span style="color: #6c71c4;">:target</span> nil
       <span style="color: #6c71c4;">:cwd</span> nil<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">rustic-mode-auto-save-hook</span> <span style="color: #2aa198;">()</span>
  <span style="color: #d33682;">"Enable auto-saving in rustic-mode buffers."</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">when</span> buffer-file-name
    <span style="color: #b58900;">(</span><span style="color: #859900;">setq-local</span> compilation-ask-about-save nil<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'rustic-mode-hook 'rustic-mode-auto-save-hook<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>add-hook 'rust-mode-hook 'subword-mode<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">lsp-lens</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'rustic-mode-hook 'lsp-lens-mode<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Flycheck
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'flycheck-rust<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">flycheck</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> flycheck-rustic-clippy-executable <span style="color: #2aa198;">"cargo-clippy"</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">unless</span> <span style="color: #2aa198;">(</span>member 'rustic-clippy flycheck-checkers<span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">setq</span> flycheck-checkers <span style="color: #b58900;">(</span>cons 'rustic-clippy flycheck-checkers<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Org-Babel Integration
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'ob-rust<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
