org-init/init.org
*** SQL Stuff

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ SQL")
#+END_SRC

Support formatting SQL buffers.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'format-sql)
#+END_SRC

Use the builtin =sql-mode= in Org blocks.

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(ob-sql-mode))

(require 'ob-sql-mode)
#+END_SRC

Emacs own interface for SQL databases.

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(emacsql
   emacsql-sqlite-module))
#+END_SRC

*** Web Development

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Web Development")
#+END_SRC

Extensions to the standard =html-mode=.

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(auto-rename-tag
   cakecrumbs
   showcss-mode))

(setq cakecrumbs-html-major-modes '(html-mode web-mode nxml-mode sgml-mode)
      cakecrumbs-scss-major-modes '(scss-mode less-css-mode css-mode))
(cakecrumbs-auto-setup)

(defun sm/toggle-showcss()
  "Toggle showcss-mode"
  (interactive)
  (if (derived-mode-p
       'html-mode
       'nxml-mode
       'nxhtml-mode
       'web-mode
       'handlebars-mode)
      (showcss-mode 'toggle)
    (message "Not in an html mode")))
(global-set-key (kbd "C-c C-k") 'sm/toggle-showcss)
#+END_SRC

Completion

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(ac-html-bootstrap
   ac-html-csswatcher
   company-web
   counsel-css))

(require 'counsel-css)
#+END_SRC

Template page support.

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(jinja2-mode
   web-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'react-snippets)

(require 'react-snippets)
#+END_SRC

*** JavaScript

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ JavaScript")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(js2-mode
   js2-highlight-vars
   js2-refactor
   js2hl
   xref-js2))

(require 'js2-mode)

(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))

(require 'js2-refactor)

(add-hook 'js2-mode-hook #'js2-refactor-mode)
(js2r-add-keybindings-with-prefix "C-c C-r")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'js2-mode)

(add-to-list 'auto-mode-alist '("\\.mjs\\'" . js2-mode))
#+END_SRC

Integration of [[https://beautifier.io/][beautifier.io]].

#+BEGIN_SRC emacs-lisp
(skj/package-install 'web-beautify)
#+END_SRC

The underlying command-line tool is  installed by typing: =npm -g install js-beautify=.

*** Typescript

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Typescript")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(tide
   ts-comint
   typescript-mode))
#+END_SRC

To run a TypeScript interpreter (REPL) in an inferior process window =M-x
run-ts=. For the external interpreter you'll need to run =npm install -g tsun=.

Use =typescript-mode= in Org blocks.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'ob-typescript)

(require 'ob-typescript)
#+END_SRC

*** Semantic Web

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Semantic Web")
#+END_SRC

Lookup RDF prefixes

#+BEGIN_SRC emacs-lisp
(skj/package-install 'rdf-prefix)

(require 'rdf-prefix)
#+END_SRC

SPARQL mode

#+BEGIN_SRC emacs-lisp
(skj/package-install 'sparql-mode)

(require 'sparql-mode)

(add-to-list 'auto-mode-alist '("\\.sparql$" . sparql-mode))
(add-to-list 'auto-mode-alist '("\\.rq$" . sparql-mode))
#+END_SRC

Use =sparql-mode= in Org blocks.

#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((sparql . t)))
#+END_SRC

