org-init/init.html

<div id="outline-container-org9b9a02c" class="outline-4">
<h4 id="org9b9a02c"><span class="section-number-4">7.6.6.</span> PEST Mode</h4>
<div class="outline-text-4" id="text-7-6-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>flycheck-pest
   pest-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa37dac" class="outline-4">
<h4 id="orgaa37dac"><span class="section-number-4">7.6.7.</span> SQL Stuff</h4>
<div class="outline-text-4" id="text-7-6-7">
<p>
Support formatting SQL buffers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'format-sql<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Use the builtin <code>sql-mode</code> in Org blocks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>ob-sql-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">ob-sql-mode</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Emacs own interface for SQL databases.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>emacsql
   emacsql-sqlite-module<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgabf6a0f" class="outline-4">
<h4 id="orgabf6a0f"><span class="section-number-4">7.6.8.</span> Web Development</h4>
<div class="outline-text-4" id="text-7-6-8">
<p>
Extensions to the standard <code>html-mode</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>auto-rename-tag
   cakecrumbs
   showcss-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> cakecrumbs-html-major-modes '<span style="color: #2aa198;">(</span>html-mode web-mode nxml-mode sgml-mode<span style="color: #2aa198;">)</span>
      cakecrumbs-scss-major-modes '<span style="color: #2aa198;">(</span>scss-mode less-css-mode css-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>cakecrumbs-auto-setup<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">defun</span> <span style="color: #b58900;">sm/toggle-showcss</span><span style="color: #2aa198;">()</span>
  <span style="color: #d33682;">"Toggle showcss-mode"</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">interactive</span><span style="color: #2aa198;">)</span>
  <span style="color: #2aa198;">(</span><span style="color: #859900;">if</span> <span style="color: #b58900;">(</span>derived-mode-p
       'html-mode
       'nxml-mode
       'nxhtml-mode
       'web-mode
       'handlebars-mode<span style="color: #b58900;">)</span>
      <span style="color: #b58900;">(</span>showcss-mode 'toggle<span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span>message <span style="color: #2aa198;">"Not in an html mode"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>global-set-key <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-c C-k"</span><span style="color: #2aa198;">)</span> 'sm/toggle-showcss<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Completion
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>ac-html-bootstrap
   ac-html-csswatcher
   company-web
   counsel-css<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">counsel-css</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Template page support.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>jinja2-mode
   web-mode<span style="color: #2aa198;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'react-snippets<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">react-snippets</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org640f834" class="outline-4">
<h4 id="org640f834"><span class="section-number-4">7.6.9.</span> JavaScript</h4>
<div class="outline-text-4" id="text-7-6-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>js2-mode
   js2-highlight-vars
   js2-refactor
   js2hl
   xref-js2<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">js2-mode</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-to-list 'auto-mode-alist '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"\\.js\\'"</span> . js2-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">js2-refactor</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'js2-mode-hook #'js2-refactor-mode<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>js2r-add-keybindings-with-prefix <span style="color: #2aa198;">"C-c C-r"</span><span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">js2-mode</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-to-list 'auto-mode-alist '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"\\.mjs\\'"</span> . js2-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Integration of <a href="https://beautifier.io/">beautifier.io</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'web-beautify<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
The underlying command-line tool is  installed by typing: <code>npm -g install js-beautify</code>.
</p>
</div>
</div>

<div id="outline-container-org52411d7" class="outline-4">
<h4 id="org52411d7"><span class="section-number-4">7.6.10.</span> Typescript</h4>
<div class="outline-text-4" id="text-7-6-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>tide
   ts-comint
   typescript-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
To run a TypeScript interpreter (REPL) in an inferior process window <code>M-x
run-ts</code>. For the external interpreter you'll need to run <code>npm install -g tsun</code>.
</p>

<p>
Use <code>typescript-mode</code> in Org blocks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'ob-typescript<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">ob-typescript</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgecb01ab" class="outline-4">
<h4 id="orgecb01ab"><span class="section-number-4">7.6.11.</span> Semantic Web</h4>
<div class="outline-text-4" id="text-7-6-11">
<p>
Lookup RDF prefixes
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'rdf-prefix<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">rdf-prefix</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
SPARQL mode
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'sparql-mode<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">sparql-mode</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-to-list 'auto-mode-alist '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"\\.sparql$"</span> . sparql-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>add-to-list 'auto-mode-alist '<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"\\.rq$"</span> . sparql-mode<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Use <code>sparql-mode</code> in Org blocks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>org-babel-do-load-languages
 'org-babel-load-languages
 '<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span>sparql . t<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
