org-init/init.org
*** Proof Assistants
   
#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Semantic Web")
#+END_SRC

Proof General is a generic Emacs interface for proof assistants
(also known as interactive theorem provers).

It is supplied ready to use for the proof assistants Coq,
EasyCrypt, qrhl, and PhoX.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'proof-general)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(skj/package-install 'coq-commenter)

(require 'coq-commenter)

(add-hook 'coq-mode-hook 'coq-commenter-mode)

(define-key coq-commenter-mode-map
  (kbd "C-;")
  #'coq-commenter-comment-proof-in-region)
(define-key coq-commenter-mode-map
  (kbd "C-x C-;")
  #'coq-commenter-comment-proof-to-cursor)
(define-key coq-commenter-mode-map
  (kbd "C-'")
  #'coq-commenter-uncomment-proof-in-region)
(define-key coq-commenter-mode-map
  (kbd "C-x C-'")
  #'coq-commenter-uncomment-proof-in-buffer)
#+END_SRC

This package includes a collection of company-mode backends for
Proof-General's Coq mode, and many useful extensions to Proof-General.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'company-coq)

(require 'company-coq)

(add-hook 'coq-mode-hook #'company-coq-mode)
#+END_SRC

** AWS Integration

#+BEGIN_SRC emacs-lisp
(skj/package-install
 '(aws-snippets
   awscli-capf
   cfn-mode
   flycheck-cfn))

(require 'awscli-capf)

(add-hook 'shell-mode-hook
          (lambda ()
            (add-to-list 'completion-at-point-functions 'awscli-capf)))

(require 'flycheck-cfn)

(flycheck-cfn-setup)
#+END_SRC

Also consider =aws-ec2=.

** Developer Services
*** Wakatime

[[https://wakatime.com/emacs][Wakatime]] service customization. This service tries to keep track of what
projects and what tools you use as an engineer. Set the API key in =~/.wakatime.cfg=.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'wakatime-mode)

(global-wakatime-mode)

(setq wakatime-cli-path (locate-file "wakatime-cli" exec-path))
#+END_SRC

** For Fun

Don't forget to =M-x asm-blox=!

#+BEGIN_SRC emacs-lisp
(skj/package-install 'asm-blox)
#+END_SRC

Emacs screen saver, note that both of the configuration values are in seconds.

#+BEGIN_SRC emacs-lisp
(skj/package-install 'gameoflife)

(require 'gameoflife)

(setq gameoflife-animation-speed 0.5
      gameoflife-screensaver-timeout (* 60 30))

(gameoflife-screensaver-mode)
#+END_SRC


* Work Configuration

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § Work Configuration")
#+END_SRC

Only basic information should exist in here, put the rest in external
resources referenced in [[*Work Packages]].

** Paths

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Paths")
#+END_SRC

These are either common on dev boxes or laptop environments.

#+BEGIN_SRC emacs-lisp :exports none
(dolist (path '("~/bin" "~/.toolbox/bin"))
  (exec-path-prepend path))
#+END_SRC

** Customization

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Customization")
#+END_SRC

These parallel their non-work values.

#+BEGIN_SRC emacs-lisp
(defcustom
  skj/work-email
  "simonjo@amazon.com"
  "Work email address."
  :tag "Primary email address"
  :group 'skj
  :type 'string)

(defcustom
  skj/work-project-root-dir
  (expand-file-name (concat-path skj/project-root-dir "Amazon"))
  "Root directory for work development projects."
  :tag "Work projects' root directory"
  :group 'skj
  :type 'directory)
#+END_SRC

** Work Packages

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Work Packages")
#+END_SRC

The =work= directory should be a symlink to a Git repository containing any
work-specific packages.

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (concat-path user-emacs-directory "lib/work"))
#+END_SRC

** Org Mode

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § ▶ ⁋ Org Mode")
#+END_SRC

Load initial work org files, there may be more, but this is a start.

#+BEGIN_SRC emacs-lisp
(setq work-org-directory
      (concat-path skj/work-project-root-dir "/SimonjoDocuments/emacs-org"))

(setq org-agenda-files
      (append org-agenda-files
              (list (concat work-org-directory "/work.org")
                    (concat work-org-directory "/people.org"))))
#+END_SRC


* Finishing Up

#+BEGIN_SRC emacs-lisp :exports none
(message "INIT: § Finishing Up")
#+END_SRC

These things need to be last!

