org-init/init.html

<div id="outline-container-org0efa057" class="outline-4">
<h4 id="org0efa057"><span class="section-number-4">7.6.12.</span> Proof Assistants</h4>
<div class="outline-text-4" id="text-7-6-12">
<p>
Proof General is a generic Emacs interface for proof assistants
(also known as interactive theorem provers).
</p>

<p>
It is supplied ready to use for the proof assistants Coq,
EasyCrypt, qrhl, and PhoX.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'proof-general<span style="color: #657b83;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'coq-commenter<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">coq-commenter</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'coq-mode-hook 'coq-commenter-mode<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>define-key coq-commenter-mode-map
  <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-;"</span><span style="color: #2aa198;">)</span>
  #'coq-commenter-comment-proof-in-region<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>define-key coq-commenter-mode-map
  <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-x C-;"</span><span style="color: #2aa198;">)</span>
  #'coq-commenter-comment-proof-to-cursor<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>define-key coq-commenter-mode-map
  <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-'"</span><span style="color: #2aa198;">)</span>
  #'coq-commenter-uncomment-proof-in-region<span style="color: #657b83;">)</span>
<span style="color: #657b83;">(</span>define-key coq-commenter-mode-map
  <span style="color: #2aa198;">(</span>kbd <span style="color: #2aa198;">"C-x C-'"</span><span style="color: #2aa198;">)</span>
  #'coq-commenter-uncomment-proof-in-buffer<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
This package includes a collection of company-mode backends for
Proof-General's Coq mode, and many useful extensions to Proof-General.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'company-coq<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">company-coq</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'coq-mode-hook #'company-coq-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1cdec41" class="outline-3">
<h3 id="org1cdec41"><span class="section-number-3">7.7.</span> AWS Integration</h3>
<div class="outline-text-3" id="text-7-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install
 '<span style="color: #2aa198;">(</span>aws-snippets
   awscli-capf
   cfn-mode
   flycheck-cfn<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">awscli-capf</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>add-hook 'shell-mode-hook
          <span style="color: #2aa198;">(</span><span style="color: #859900;">lambda</span> <span style="color: #b58900;">()</span>
            <span style="color: #b58900;">(</span>add-to-list 'completion-at-point-functions 'awscli-capf<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">flycheck-cfn</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>flycheck-cfn-setup<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Also consider <code>aws-ec2</code>.
</p>
</div>
</div>

<div id="outline-container-org74748a4" class="outline-3">
<h3 id="org74748a4"><span class="section-number-3">7.8.</span> Developer Services</h3>
<div class="outline-text-3" id="text-7-8">
</div>
<div id="outline-container-org592f817" class="outline-4">
<h4 id="org592f817"><span class="section-number-4">7.8.1.</span> Wakatime</h4>
<div class="outline-text-4" id="text-7-8-1">
<p>
<a href="https://wakatime.com/emacs">Wakatime</a> service customization. This service tries to keep track of what
projects and what tools you use as an engineer. Set the API key in <code>~/.wakatime.cfg</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'wakatime-mode<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>global-wakatime-mode<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> wakatime-cli-path <span style="color: #2aa198;">(</span>locate-file <span style="color: #2aa198;">"wakatime-cli"</span> exec-path<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1ca8e4e" class="outline-3">
<h3 id="org1ca8e4e"><span class="section-number-3">7.9.</span> For Fun</h3>
<div class="outline-text-3" id="text-7-9">
<p>
Don't forget to <code>M-x asm-blox</code>!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'asm-blox<span style="color: #657b83;">)</span>
</pre>
</div>

<p>
Emacs screen saver, note that both of the configuration values are in seconds.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>skj/package-install 'gameoflife<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">require</span> '<span style="color: #268bd2;">gameoflife</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> gameoflife-animation-speed 0.5
      gameoflife-screensaver-timeout <span style="color: #2aa198;">(</span>* 60 30<span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span>gameoflife-screensaver-mode<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orge07bce3" class="outline-2">
<h2 id="orge07bce3"><span class="section-number-2">8.</span> Work Configuration</h2>
<div class="outline-text-2" id="text-8">
<p>
Only basic information should exist in here, put the rest in external
resources referenced in <a href="#org62c4122">8.3</a>.
</p>
</div>

<div id="outline-container-orga8893a2" class="outline-3">
<h3 id="orga8893a2"><span class="section-number-3">8.1.</span> Paths</h3>
<div class="outline-text-3" id="text-8-1">
<p>
These are either common on dev boxes or laptop environments.
</p>
</div>
</div>

<div id="outline-container-org03a4394" class="outline-3">
<h3 id="org03a4394"><span class="section-number-3">8.2.</span> Customization</h3>
<div class="outline-text-3" id="text-8-2">
<p>
These parallel their non-work values.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">defcustom</span>
  skj/work-email
  <span style="color: #2aa198;">"simonjo@amazon.com"</span>
  <span style="color: #d33682;">"Work email address."</span>
  <span style="color: #6c71c4;">:tag</span> <span style="color: #2aa198;">"Primary email address"</span>
  <span style="color: #6c71c4;">:group</span> 'skj
  <span style="color: #6c71c4;">:type</span> 'string<span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">defcustom</span>
  skj/work-project-root-dir
  <span style="color: #2aa198;">(</span>expand-file-name <span style="color: #b58900;">(</span>concat-path skj/project-root-dir <span style="color: #2aa198;">"Amazon"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
  <span style="color: #d33682;">"Root directory for work development projects."</span>
  <span style="color: #6c71c4;">:tag</span> <span style="color: #2aa198;">"Work projects' root directory"</span>
  <span style="color: #6c71c4;">:group</span> 'skj
  <span style="color: #6c71c4;">:type</span> 'directory<span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org62c4122" class="outline-3">
<h3 id="org62c4122"><span class="section-number-3">8.3.</span> Work Packages</h3>
<div class="outline-text-3" id="text-8-3">
<p>
The <code>work</code> directory should be a symlink to a Git repository containing any
work-specific packages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span>add-to-list 'load-path <span style="color: #2aa198;">(</span>concat-path user-emacs-directory <span style="color: #2aa198;">"lib/work"</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org54a5902" class="outline-3">
<h3 id="org54a5902"><span class="section-number-3">8.4.</span> Org Mode</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Load initial work org files, there may be more, but this is a start.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> work-org-directory
      <span style="color: #2aa198;">(</span>concat-path skj/work-project-root-dir <span style="color: #2aa198;">"/SimonjoDocuments/emacs-org"</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>

<span style="color: #657b83;">(</span><span style="color: #859900;">setq</span> org-agenda-files
      <span style="color: #2aa198;">(</span>append org-agenda-files
              <span style="color: #b58900;">(</span>list <span style="color: #859900;">(</span>concat work-org-directory <span style="color: #2aa198;">"/work.org"</span><span style="color: #859900;">)</span>
                    <span style="color: #859900;">(</span>concat work-org-directory <span style="color: #2aa198;">"/people.org"</span><span style="color: #859900;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #657b83;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org5cb6fc0" class="outline-2">
<h2 id="org5cb6fc0"><span class="section-number-2">9.</span> Finishing Up</h2>
<div class="outline-text-2" id="text-9">
<p>
These things need to be last!
</p>
</div>
